
Перем Данные Экспорт;
Перем КодУзла Экспорт;
Данные = Новый Структура("КодУзла, ИмяУзла, СоседнийУзел",
 "0", 
 "html", 
 Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
  "1", 
  "html", 
  Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
   "2", 
   "body", 
   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
    "3", 
    "div", 
    Новый Структура("КодУзла, ИмяУзла, Содержимое",
     "4", 
     "class", 
     "container"
    ), 
    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
     "6", 
     "#comment", 
     "Navbar      ==================================================", 
     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
      "8", 
      "div", 
      Новый Структура("КодУзла, ИмяУзла, Содержимое",
       "9", 
       "class", 
       "bs-docs-section clearfix"
      ), 
      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
       "11", 
       "div", 
       Новый Структура("КодУзла, ИмяУзла, Содержимое",
        "12", 
        "class", 
        "row"
       ), 
       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
        "14", 
        "div", 
        Новый Структура("КодУзла, ИмяУзла, Содержимое",
         "15", 
         "class", 
         "col-lg-12"
        ), 
        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
         "17", 
         "div", 
         Новый Структура("КодУзла, ИмяУзла, Содержимое",
          "18", 
          "class", 
          "page-header"
         ), 
         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
          "20", 
          "h1", 
          Новый Структура("КодУзла, ИмяУзла, Содержимое",
           "21", 
           "id", 
           "navbars"
          ), 
          Новый Структура("КодУзла, ИмяУзла, Содержимое",
           "22", 
           "#text", 
           "Navbars"
          )
         ), 
         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
          "25", 
          "div", 
          Новый Структура("КодУзла, ИмяУзла, Содержимое",
           "26", 
           "class", 
           "bs-component"
          ), 
          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
           "28", 
           "nav", 
           Новый Структура("КодУзла, ИмяУзла, Содержимое",
            "29", 
            "class", 
            "navbar navbar-expand-lg navbar-dark bg-primary"
           ), 
           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
            "30", 
            "a", 
            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
             "31", 
             "class", 
             "navbar-brand", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "32", 
              "href", 
              "#"
             )
            ), 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "33", 
             "#text", 
             "Navbar"
            ), 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
             "35", 
             "button", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
              "36", 
              "class", 
              "navbar-toggler", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "37", 
               "type", 
               "button", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "38", 
                "data_toggle", 
                "collapse", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "39", 
                 "data_target", 
                 "#navbarColor01", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "40", 
                  "aria_controls", 
                  "navbarColor01", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "41", 
                   "aria_expanded", 
                   "false", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "42", 
                    "aria_label", 
                    "Toggle navigation"
                   )
                  )
                 )
                )
               )
              )
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты",
              "44", 
              "span", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "45", 
               "class", 
               "navbar-toggler-icon"
              )
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
              "48", 
              "div", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "49", 
               "class", 
               "collapse navbar-collapse", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "50", 
                "id", 
                "navbarColor01"
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "52", 
               "ul", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "53", 
                "class", 
                "navbar-nav mr-auto"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "54", 
                "li", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "55", 
                 "class", 
                 "nav-item active"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                 "57", 
                 "a", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "58", 
                  "class", 
                  "nav-link", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "59", 
                   "href", 
                   "#"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "60", 
                  "#text", 
                  "Home", 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "61", 
                   "span", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "62", 
                    "class", 
                    "sr-only"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "63", 
                    "#text", 
                    "(current)"
                   )
                  )
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "66", 
                 "li", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "67", 
                  "class", 
                  "nav-item"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "69", 
                  "a", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "70", 
                   "class", 
                   "nav-link", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "71", 
                    "href", 
                    "#"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "72", 
                   "#text", 
                   "Features"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "75", 
                  "li", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "76", 
                   "class", 
                   "nav-item"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "78", 
                   "a", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "79", 
                    "class", 
                    "nav-link", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "80", 
                     "href", 
                     "#"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "81", 
                    "#text", 
                    "Pricing"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "84", 
                   "li", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "85", 
                    "class", 
                    "nav-item"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "87", 
                    "a", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "88", 
                     "class", 
                     "nav-link", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "89", 
                      "href", 
                      "#"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "90", 
                     "#text", 
                     "About"
                    )
                   )
                  )
                 )
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "93", 
                "form", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "94", 
                 "class", 
                 "form-inline my-2 my-lg-0"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                 "96", 
                 "input", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "97", 
                  "class", 
                  "form-control mr-sm-2", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "98", 
                   "type", 
                   "text", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "99", 
                    "placeholder", 
                    "Search"
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "100", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "101", 
                   "class", 
                   "btn btn-secondary my-2 my-sm-0", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "102", 
                    "type", 
                    "submit"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "103", 
                   "#text", 
                   "Search"
                  )
                 )
                )
               )
              )
             )
            )
           )
          ), 
          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
           "108", 
           "div", 
           Новый Структура("КодУзла, ИмяУзла, Содержимое",
            "109", 
            "class", 
            "bs-component"
           ), 
           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
            "111", 
            "nav", 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "112", 
             "class", 
             "navbar navbar-expand-lg navbar-dark bg-dark"
            ), 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
             "113", 
             "a", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
              "114", 
              "class", 
              "navbar-brand", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "115", 
               "href", 
               "#"
              )
             ), 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "116", 
              "#text", 
              "Navbar"
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
              "118", 
              "button", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "119", 
               "class", 
               "navbar-toggler", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "120", 
                "type", 
                "button", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "121", 
                 "data_toggle", 
                 "collapse", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "122", 
                  "data_target", 
                  "#navbarColor02", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "123", 
                   "aria_controls", 
                   "navbarColor02", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "124", 
                    "aria_expanded", 
                    "false", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "125", 
                     "aria_label", 
                     "Toggle navigation"
                    )
                   )
                  )
                 )
                )
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты",
               "127", 
               "span", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "128", 
                "class", 
                "navbar-toggler-icon"
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
               "131", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "132", 
                "class", 
                "collapse navbar-collapse", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "133", 
                 "id", 
                 "navbarColor02"
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "135", 
                "ul", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "136", 
                 "class", 
                 "navbar-nav mr-auto"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "137", 
                 "li", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "138", 
                  "class", 
                  "nav-item active"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "140", 
                  "a", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "141", 
                   "class", 
                   "nav-link", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "142", 
                    "href", 
                    "#"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "143", 
                   "#text", 
                   "Home", 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "144", 
                    "span", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "145", 
                     "class", 
                     "sr-only"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "146", 
                     "#text", 
                     "(current)"
                    )
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "149", 
                  "li", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "150", 
                   "class", 
                   "nav-item"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "152", 
                   "a", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "153", 
                    "class", 
                    "nav-link", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "154", 
                     "href", 
                     "#"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "155", 
                    "#text", 
                    "Features"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "158", 
                   "li", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "159", 
                    "class", 
                    "nav-item"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "161", 
                    "a", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "162", 
                     "class", 
                     "nav-link", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "163", 
                      "href", 
                      "#"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "164", 
                     "#text", 
                     "Pricing"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "167", 
                    "li", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "168", 
                     "class", 
                     "nav-item"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "170", 
                     "a", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "171", 
                      "class", 
                      "nav-link", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "172", 
                       "href", 
                       "#"
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "173", 
                      "#text", 
                      "About"
                     )
                    )
                   )
                  )
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                 "176", 
                 "form", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "177", 
                  "class", 
                  "form-inline my-2 my-lg-0"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                  "179", 
                  "input", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "180", 
                   "class", 
                   "form-control mr-sm-2", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "181", 
                    "type", 
                    "text", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "182", 
                     "placeholder", 
                     "Search"
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "183", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "184", 
                    "class", 
                    "btn btn-secondary my-2 my-sm-0", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "185", 
                     "type", 
                     "submit"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "186", 
                    "#text", 
                    "Search"
                   )
                  )
                 )
                )
               )
              )
             )
            )
           ), 
           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
            "191", 
            "div", 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "192", 
             "class", 
             "bs-component"
            ), 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
             "194", 
             "nav", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "195", 
              "class", 
              "navbar navbar-expand-lg navbar-light bg-light"
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
              "196", 
              "a", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "197", 
               "class", 
               "navbar-brand", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "198", 
                "href", 
                "#"
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "199", 
               "#text", 
               "Navbar"
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "201", 
               "button", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "202", 
                "class", 
                "navbar-toggler", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "203", 
                 "type", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "204", 
                  "data_toggle", 
                  "collapse", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "205", 
                   "data_target", 
                   "#navbarColor03", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "206", 
                    "aria_controls", 
                    "navbarColor03", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "207", 
                     "aria_expanded", 
                     "false", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "208", 
                      "aria_label", 
                      "Toggle navigation"
                     )
                    )
                   )
                  )
                 )
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                "210", 
                "span", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "211", 
                 "class", 
                 "navbar-toggler-icon"
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "214", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "215", 
                 "class", 
                 "collapse navbar-collapse", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "216", 
                  "id", 
                  "navbarColor03"
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "218", 
                 "ul", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "219", 
                  "class", 
                  "navbar-nav mr-auto"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "220", 
                  "li", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "221", 
                   "class", 
                   "nav-item active"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "223", 
                   "a", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "224", 
                    "class", 
                    "nav-link", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "225", 
                     "href", 
                     "#"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "226", 
                    "#text", 
                    "Home", 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "227", 
                     "span", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "228", 
                      "class", 
                      "sr-only"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "229", 
                      "#text", 
                      "(current)"
                     )
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "232", 
                   "li", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "233", 
                    "class", 
                    "nav-item"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "235", 
                    "a", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "236", 
                     "class", 
                     "nav-link", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "237", 
                      "href", 
                      "#"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "238", 
                     "#text", 
                     "Features"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "241", 
                    "li", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "242", 
                     "class", 
                     "nav-item"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "244", 
                     "a", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "245", 
                      "class", 
                      "nav-link", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "246", 
                       "href", 
                       "#"
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "247", 
                      "#text", 
                      "Pricing"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "250", 
                     "li", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "251", 
                      "class", 
                      "nav-item"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                      "253", 
                      "a", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "254", 
                       "class", 
                       "nav-link", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "255", 
                        "href", 
                        "#"
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "256", 
                       "#text", 
                       "About"
                      )
                     )
                    )
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "259", 
                  "form", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "260", 
                   "class", 
                   "form-inline my-2 my-lg-0"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                   "262", 
                   "input", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "263", 
                    "class", 
                    "form-control mr-sm-2", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "264", 
                     "type", 
                     "text", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "265", 
                      "placeholder", 
                      "Search"
                     )
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "266", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "267", 
                     "class", 
                     "btn btn-secondary my-2 my-sm-0", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "268", 
                      "type", 
                      "submit"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "269", 
                     "#text", 
                     "Search"
                    )
                   )
                  )
                 )
                )
               )
              )
             )
            )
           )
          )
         )
        )
       )
      ), 
      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
       "277", 
       "#comment", 
       "Buttons      ==================================================", 
       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
        "279", 
        "div", 
        Новый Структура("КодУзла, ИмяУзла, Содержимое",
         "280", 
         "class", 
         "bs-docs-section"
        ), 
        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
         "282", 
         "div", 
         Новый Структура("КодУзла, ИмяУзла, Содержимое",
          "283", 
          "class", 
          "page-header"
         ), 
         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
          "285", 
          "div", 
          Новый Структура("КодУзла, ИмяУзла, Содержимое",
           "286", 
           "class", 
           "row"
          ), 
          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
           "288", 
           "div", 
           Новый Структура("КодУзла, ИмяУзла, Содержимое",
            "289", 
            "class", 
            "col-lg-12"
           ), 
           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
            "291", 
            "h1", 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "292", 
             "id", 
             "buttons"
            ), 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "293", 
             "#text", 
             "Buttons"
            )
           )
          )
         ), 
         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
          "298", 
          "div", 
          Новый Структура("КодУзла, ИмяУзла, Содержимое",
           "299", 
           "class", 
           "row"
          ), 
          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
           "301", 
           "div", 
           Новый Структура("КодУзла, ИмяУзла, Содержимое",
            "302", 
            "class", 
            "col-lg-7"
           ), 
           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
            "304", 
            "p", 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "305", 
             "class", 
             "bs-component"
            ), 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
             "307", 
             "button", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
              "308", 
              "type", 
              "button", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "309", 
               "class", 
               "btn btn-primary"
              )
             ), 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "310", 
              "#text", 
              "Primary"
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
              "312", 
              "button", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "313", 
               "type", 
               "button", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "314", 
                "class", 
                "btn btn-secondary"
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "315", 
               "#text", 
               "Secondary"
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "317", 
               "button", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "318", 
                "type", 
                "button", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "319", 
                 "class", 
                 "btn btn-success"
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "320", 
                "#text", 
                "Success"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "322", 
                "button", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "323", 
                 "type", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "324", 
                  "class", 
                  "btn btn-info"
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "325", 
                 "#text", 
                 "Info"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "327", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "328", 
                  "type", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "329", 
                   "class", 
                   "btn btn-warning"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "330", 
                  "#text", 
                  "Warning"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "332", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "333", 
                   "type", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "334", 
                    "class", 
                    "btn btn-danger"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "335", 
                   "#text", 
                   "Danger"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "337", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "338", 
                    "type", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "339", 
                     "class", 
                     "btn btn-link"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "340", 
                    "#text", 
                    "Link"
                   )
                  )
                 )
                )
               )
              )
             )
            ), 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
             "343", 
             "p", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "344", 
              "class", 
              "bs-component"
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
              "346", 
              "button", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "347", 
               "type", 
               "button", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "348", 
                "class", 
                "btn btn-primary disabled"
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "349", 
               "#text", 
               "Primary"
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "351", 
               "button", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "352", 
                "type", 
                "button", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "353", 
                 "class", 
                 "btn btn-secondary disabled"
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "354", 
                "#text", 
                "Secondary"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "356", 
                "button", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "357", 
                 "type", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "358", 
                  "class", 
                  "btn btn-success disabled"
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "359", 
                 "#text", 
                 "Success"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "361", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "362", 
                  "type", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "363", 
                   "class", 
                   "btn btn-info disabled"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "364", 
                  "#text", 
                  "Info"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "366", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "367", 
                   "type", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "368", 
                    "class", 
                    "btn btn-warning disabled"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "369", 
                   "#text", 
                   "Warning"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "371", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "372", 
                    "type", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "373", 
                     "class", 
                     "btn btn-danger disabled"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "374", 
                    "#text", 
                    "Danger"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "376", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "377", 
                     "type", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "378", 
                      "class", 
                      "btn btn-link disabled"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "379", 
                     "#text", 
                     "Link"
                    )
                   )
                  )
                 )
                )
               )
              )
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
              "382", 
              "p", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "383", 
               "class", 
               "bs-component"
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "385", 
               "button", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "386", 
                "type", 
                "button", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "387", 
                 "class", 
                 "btn btn-outline-primary"
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "388", 
                "#text", 
                "Primary"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "390", 
                "button", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "391", 
                 "type", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "392", 
                  "class", 
                  "btn btn-outline-secondary"
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "393", 
                 "#text", 
                 "Secondary"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "395", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "396", 
                  "type", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "397", 
                   "class", 
                   "btn btn-outline-success"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "398", 
                  "#text", 
                  "Success"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "400", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "401", 
                   "type", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "402", 
                    "class", 
                    "btn btn-outline-info"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "403", 
                   "#text", 
                   "Info"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "405", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "406", 
                    "type", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "407", 
                     "class", 
                     "btn btn-outline-warning"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "408", 
                    "#text", 
                    "Warning"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "410", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "411", 
                     "type", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "412", 
                      "class", 
                      "btn btn-outline-danger"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "413", 
                     "#text", 
                     "Danger"
                    )
                   )
                  )
                 )
                )
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "416", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "417", 
                "class", 
                "bs-component"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "419", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "420", 
                 "class", 
                 "btn-group", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "421", 
                  "role", 
                  "group", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "422", 
                   "aria_label", 
                   "Button group with nested dropdown"
                  )
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "424", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "425", 
                  "type", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "426", 
                   "class", 
                   "btn btn-primary"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "427", 
                  "#text", 
                  "Primary"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "429", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "430", 
                   "class", 
                   "btn-group", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "431", 
                    "role", 
                    "group"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                   "433", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "434", 
                    "id", 
                    "btnGroupDrop1", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "435", 
                     "type", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "436", 
                      "class", 
                      "btn btn-primary dropdown-toggle", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "437", 
                       "data_toggle", 
                       "dropdown", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "438", 
                        "aria_haspopup", 
                        "true", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "439", 
                         "aria_expanded", 
                         "false"
                        )
                       )
                      )
                     )
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "441", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "442", 
                     "class", 
                     "dropdown-menu", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "443", 
                      "aria_labelledby", 
                      "btnGroupDrop1"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "445", 
                     "a", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "446", 
                      "class", 
                      "dropdown-item", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "447", 
                       "href", 
                       "#"
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "448", 
                      "#text", 
                      "Dropdown link"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                      "450", 
                      "a", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "451", 
                       "class", 
                       "dropdown-item", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "452", 
                        "href", 
                        "#"
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "453", 
                       "#text", 
                       "Dropdown link"
                      )
                     )
                    )
                   )
                  )
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "458", 
                 "div", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "459", 
                  "class", 
                  "btn-group", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "460", 
                   "role", 
                   "group", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "461", 
                    "aria_label", 
                    "Button group with nested dropdown"
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "463", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "464", 
                   "type", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "465", 
                    "class", 
                    "btn btn-success"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "466", 
                   "#text", 
                   "Success"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "468", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "469", 
                    "class", 
                    "btn-group", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "470", 
                     "role", 
                     "group"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                    "472", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "473", 
                     "id", 
                     "btnGroupDrop2", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "474", 
                      "type", 
                      "button", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "475", 
                       "class", 
                       "btn btn-success dropdown-toggle", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "476", 
                        "data_toggle", 
                        "dropdown", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "477", 
                         "aria_haspopup", 
                         "true", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "478", 
                          "aria_expanded", 
                          "false"
                         )
                        )
                       )
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "480", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "481", 
                      "class", 
                      "dropdown-menu", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "482", 
                       "aria_labelledby", 
                       "btnGroupDrop2"
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "484", 
                      "a", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "485", 
                       "class", 
                       "dropdown-item", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "486", 
                        "href", 
                        "#"
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "487", 
                       "#text", 
                       "Dropdown link"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "489", 
                       "a", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "490", 
                        "class", 
                        "dropdown-item", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "491", 
                         "href", 
                         "#"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "492", 
                        "#text", 
                        "Dropdown link"
                       )
                      )
                     )
                    )
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "497", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "498", 
                   "class", 
                   "btn-group", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "499", 
                    "role", 
                    "group", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "500", 
                     "aria_label", 
                     "Button group with nested dropdown"
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "502", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "503", 
                    "type", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "504", 
                     "class", 
                     "btn btn-info"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "505", 
                    "#text", 
                    "Info"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "507", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "508", 
                     "class", 
                     "btn-group", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "509", 
                      "role", 
                      "group"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                     "511", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "512", 
                      "id", 
                      "btnGroupDrop3", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "513", 
                       "type", 
                       "button", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "514", 
                        "class", 
                        "btn btn-info dropdown-toggle", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "515", 
                         "data_toggle", 
                         "dropdown", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "516", 
                          "aria_haspopup", 
                          "true", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "517", 
                           "aria_expanded", 
                           "false"
                          )
                         )
                        )
                       )
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                      "519", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "520", 
                       "class", 
                       "dropdown-menu", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "521", 
                        "aria_labelledby", 
                        "btnGroupDrop3"
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "523", 
                       "a", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "524", 
                        "class", 
                        "dropdown-item", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "525", 
                         "href", 
                         "#"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "526", 
                        "#text", 
                        "Dropdown link"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "528", 
                        "a", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "529", 
                         "class", 
                         "dropdown-item", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "530", 
                          "href", 
                          "#"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "531", 
                         "#text", 
                         "Dropdown link"
                        )
                       )
                      )
                     )
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "536", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "537", 
                    "class", 
                    "btn-group", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "538", 
                     "role", 
                     "group", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "539", 
                      "aria_label", 
                      "Button group with nested dropdown"
                     )
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "541", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "542", 
                     "type", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "543", 
                      "class", 
                      "btn btn-danger"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "544", 
                     "#text", 
                     "Danger"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "546", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "547", 
                      "class", 
                      "btn-group", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "548", 
                       "role", 
                       "group"
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                      "550", 
                      "button", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "551", 
                       "id", 
                       "btnGroupDrop4", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "552", 
                        "type", 
                        "button", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "553", 
                         "class", 
                         "btn btn-danger dropdown-toggle", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "554", 
                          "data_toggle", 
                          "dropdown", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "555", 
                           "aria_haspopup", 
                           "true", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "556", 
                            "aria_expanded", 
                            "false"
                           )
                          )
                         )
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "558", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "559", 
                        "class", 
                        "dropdown-menu", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "560", 
                         "aria_labelledby", 
                         "btnGroupDrop4"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "562", 
                        "a", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "563", 
                         "class", 
                         "dropdown-item", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "564", 
                          "href", 
                          "#"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "565", 
                         "#text", 
                         "Dropdown link"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "567", 
                         "a", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "568", 
                          "class", 
                          "dropdown-item", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "569", 
                           "href", 
                           "#"
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "570", 
                          "#text", 
                          "Dropdown link"
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "576", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "577", 
                 "class", 
                 "bs-component"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "579", 
                 "button", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "580", 
                  "type", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "581", 
                   "class", 
                   "btn btn-primary btn-lg"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "582", 
                  "#text", 
                  "Large button"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "584", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "585", 
                   "type", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "586", 
                    "class", 
                    "btn btn-primary"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "587", 
                   "#text", 
                   "Default button"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "589", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "590", 
                    "type", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "591", 
                     "class", 
                     "btn btn-primary btn-sm"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "592", 
                    "#text", 
                    "Small button"
                   )
                  )
                 )
                )
               )
              )
             )
            )
           ), 
           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
            "596", 
            "div", 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "597", 
             "class", 
             "col-lg-5"
            ), 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
             "599", 
             "p", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "600", 
              "class", 
              "bs-component"
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
              "602", 
              "button", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "603", 
               "type", 
               "button", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "604", 
                "class", 
                "btn btn-primary btn-lg btn-block"
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "605", 
               "#text", 
               "Block level button"
              )
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
              "608", 
              "div", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "609", 
               "class", 
               "bs-component", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "610", 
                "style", 
                "margin-bottom: 15px;"
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
               "612", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "613", 
                "class", 
                "btn-group", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "614", 
                 "data_toggle", 
                 "buttons"
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "616", 
                "label", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "617", 
                 "class", 
                 "btn btn-primary active"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                 "619", 
                 "input", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "620", 
                  "type", 
                  "checkbox", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "621", 
                   "checked", 
                   "checked"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "622", 
                  "#text", 
                  "Checkbox 1"
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "624", 
                 "label", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "625", 
                  "class", 
                  "btn btn-primary"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                  "627", 
                  "input", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "628", 
                   "type", 
                   "checkbox"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "629", 
                   "#text", 
                   "Checkbox 2"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "631", 
                  "label", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "632", 
                   "class", 
                   "btn btn-primary"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                   "634", 
                   "input", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "635", 
                    "type", 
                    "checkbox"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "636", 
                    "#text", 
                    "Checkbox 3"
                   )
                  )
                 )
                )
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "640", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                "641", 
                "class", 
                "bs-component", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "642", 
                 "style", 
                 "margin-bottom: 15px;"
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "644", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "645", 
                 "class", 
                 "btn-group", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "646", 
                  "data_toggle", 
                  "buttons"
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "648", 
                 "label", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "649", 
                  "class", 
                  "btn btn-primary active"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                  "651", 
                  "input", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "652", 
                   "type", 
                   "radio", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "653", 
                    "name", 
                    "options", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "654", 
                     "id", 
                     "option1", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "655", 
                      "checked", 
                      "checked"
                     )
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "656", 
                   "#text", 
                   "Radio 1"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "658", 
                  "label", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "659", 
                   "class", 
                   "btn btn-primary"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                   "661", 
                   "input", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "662", 
                    "type", 
                    "radio", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "663", 
                     "name", 
                     "options", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "664", 
                      "id", 
                      "option2"
                     )
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "665", 
                    "#text", 
                    "Radio 2"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "667", 
                   "label", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "668", 
                    "class", 
                    "btn btn-primary"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                    "670", 
                    "input", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "671", 
                     "type", 
                     "radio", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "672", 
                      "name", 
                      "options", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "673", 
                       "id", 
                       "option3"
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "674", 
                     "#text", 
                     "Radio 3"
                    )
                   )
                  )
                 )
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "678", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "679", 
                 "class", 
                 "bs-component"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                 "681", 
                 "div", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "682", 
                  "class", 
                  "btn-group-vertical", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "683", 
                   "data_toggle", 
                   "buttons"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "685", 
                  "button", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "686", 
                   "type", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "687", 
                    "class", 
                    "btn btn-primary"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "688", 
                   "#text", 
                   "Button"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "690", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "691", 
                    "type", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "692", 
                     "class", 
                     "btn btn-primary"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "693", 
                    "#text", 
                    "Button"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "695", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "696", 
                     "type", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "697", 
                      "class", 
                      "btn btn-primary"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "698", 
                     "#text", 
                     "Button"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "700", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "701", 
                      "type", 
                      "button", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "702", 
                       "class", 
                       "btn btn-primary"
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "703", 
                      "#text", 
                      "Button"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "705", 
                      "button", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "706", 
                       "type", 
                       "button", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "707", 
                        "class", 
                        "btn btn-primary"
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "708", 
                       "#text", 
                       "Button"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "710", 
                       "button", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "711", 
                        "type", 
                        "button", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "712", 
                         "class", 
                         "btn btn-primary"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "713", 
                        "#text", 
                        "Button"
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "717", 
                 "div", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                  "718", 
                  "class", 
                  "bs-component", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "719", 
                   "style", 
                   "margin-bottom: 15px;"
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "721", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "722", 
                   "class", 
                   "btn-group", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "723", 
                    "role", 
                    "group", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "724", 
                     "aria_label", 
                     "Basic example"
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "726", 
                   "button", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "727", 
                    "type", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "728", 
                     "class", 
                     "btn btn-secondary"
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "729", 
                    "#text", 
                    "Left"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "731", 
                    "button", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "732", 
                     "type", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "733", 
                      "class", 
                      "btn btn-secondary"
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "734", 
                     "#text", 
                     "Middle"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "736", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "737", 
                      "type", 
                      "button", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "738", 
                       "class", 
                       "btn btn-secondary"
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "739", 
                      "#text", 
                      "Right"
                     )
                    )
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "743", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "744", 
                   "class", 
                   "bs-component", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "745", 
                    "style", 
                    "margin-bottom: 15px;"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "747", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                    "748", 
                    "class", 
                    "btn-toolbar", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "749", 
                     "role", 
                     "toolbar", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "750", 
                      "aria_label", 
                      "Toolbar with button groups"
                     )
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "752", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "753", 
                     "class", 
                     "btn-group mr-2", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "754", 
                      "role", 
                      "group", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "755", 
                       "aria_label", 
                       "First group"
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "757", 
                     "button", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "758", 
                      "type", 
                      "button", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "759", 
                       "class", 
                       "btn btn-secondary"
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "760", 
                      "#text", 
                      "1"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "762", 
                      "button", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "763", 
                       "type", 
                       "button", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "764", 
                        "class", 
                        "btn btn-secondary"
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "765", 
                       "#text", 
                       "2"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "767", 
                       "button", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "768", 
                        "type", 
                        "button", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "769", 
                         "class", 
                         "btn btn-secondary"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "770", 
                        "#text", 
                        "3"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "772", 
                        "button", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "773", 
                         "type", 
                         "button", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "774", 
                          "class", 
                          "btn btn-secondary"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "775", 
                         "#text", 
                         "4"
                        )
                       )
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "778", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "779", 
                      "class", 
                      "btn-group mr-2", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "780", 
                       "role", 
                       "group", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "781", 
                        "aria_label", 
                        "Second group"
                       )
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "783", 
                      "button", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "784", 
                       "type", 
                       "button", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "785", 
                        "class", 
                        "btn btn-secondary"
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "786", 
                       "#text", 
                       "5"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "788", 
                       "button", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "789", 
                        "type", 
                        "button", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "790", 
                         "class", 
                         "btn btn-secondary"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "791", 
                        "#text", 
                        "6"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "793", 
                        "button", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "794", 
                         "type", 
                         "button", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "795", 
                          "class", 
                          "btn btn-secondary"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "796", 
                         "#text", 
                         "7"
                        )
                       )
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                      "799", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "800", 
                       "class", 
                       "btn-group", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "801", 
                        "role", 
                        "group", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "802", 
                         "aria_label", 
                         "Third group"
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "804", 
                       "button", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "805", 
                        "type", 
                        "button", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "806", 
                         "class", 
                         "btn btn-secondary"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "807", 
                        "#text", 
                        "8"
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                )
               )
              )
             )
            )
           )
          )
         )
        ), 
        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
         "815", 
         "#comment", 
         "Typography      ==================================================", 
         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
          "817", 
          "div", 
          Новый Структура("КодУзла, ИмяУзла, Содержимое",
           "818", 
           "class", 
           "bs-docs-section"
          ), 
          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
           "820", 
           "div", 
           Новый Структура("КодУзла, ИмяУзла, Содержимое",
            "821", 
            "class", 
            "row"
           ), 
           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
            "823", 
            "div", 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "824", 
             "class", 
             "col-lg-12"
            ), 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
             "826", 
             "div", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "827", 
              "class", 
              "page-header"
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
              "829", 
              "h1", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "830", 
               "id", 
               "typography"
              ), 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "831", 
               "#text", 
               "Typography"
              )
             )
            )
           ), 
           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
            "836", 
            "#comment", 
            "Headings", 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
             "838", 
             "div", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "839", 
              "class", 
              "row"
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
              "841", 
              "div", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "842", 
               "class", 
               "col-lg-4"
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
               "844", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "845", 
                "class", 
                "bs-component"
               ), 
               Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                "847", 
                "h1", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "848", 
                 "#text", 
                 "Heading 1"
                ), 
                Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                 "850", 
                 "h2", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "851", 
                  "#text", 
                  "Heading 2"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                  "853", 
                  "h3", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "854", 
                   "#text", 
                   "Heading 3"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                   "856", 
                   "h4", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "857", 
                    "#text", 
                    "Heading 4"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                    "859", 
                    "h5", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "860", 
                     "#text", 
                     "Heading 5"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                     "862", 
                     "h6", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "863", 
                      "#text", 
                      "Heading 6"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                      "865", 
                      "h3", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "866", 
                       "#text", 
                       "Heading", 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "867", 
                        "small", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "868", 
                         "class", 
                         "text-muted"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "869", 
                         "#text", 
                         "with muted text"
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "872", 
                       "p", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "873", 
                        "class", 
                        "lead"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "874", 
                        "#text", 
                        "Vivamus sagittis lacus vel augue laoreet rutrum faucibus dolor auctor."
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                )
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "878", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "879", 
                "class", 
                "col-lg-4"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "881", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "882", 
                 "class", 
                 "bs-component"
                ), 
                Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                 "884", 
                 "h2", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "885", 
                  "#text", 
                  "Example body text"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                  "887", 
                  "p", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "888", 
                   "#text", 
                   "Nullam quis risus eget", 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "889", 
                    "a", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "890", 
                     "href", 
                     "#"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "891", 
                     "#text", 
                     "urna mollis ornare"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "892", 
                     "#text", 
                     "vel eu leo. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Nullam id dolor id nibh ultricies vehicula."
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                   "894", 
                   "p", 
                   Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                    "895", 
                    "small", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "896", 
                     "#text", 
                     "This line of text is meant to be treated as fine print."
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                    "898", 
                    "p", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "899", 
                     "#text", 
                     "The following is", 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                      "900", 
                      "strong", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "901", 
                       "#text", 
                       "rendered as bold text"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "902", 
                       "#text", 
                       "."
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                     "904", 
                     "p", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "905", 
                      "#text", 
                      "The following is", 
                      Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                       "906", 
                       "em", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "907", 
                        "#text", 
                        "rendered as italicized text"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "908", 
                        "#text", 
                        "."
                       )
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                      "910", 
                      "p", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "911", 
                       "#text", 
                       "An abbreviation of the word attribute is", 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "912", 
                        "abbr", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "913", 
                         "title", 
                         "attribute"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "914", 
                         "#text", 
                         "attr"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "915", 
                         "#text", 
                         "."
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "919", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "920", 
                 "class", 
                 "col-lg-4"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                 "922", 
                 "div", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "923", 
                  "class", 
                  "bs-component"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                  "925", 
                  "h2", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "926", 
                   "#text", 
                   "Emphasis classes"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "928", 
                   "p", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "929", 
                    "class", 
                    "text-muted"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "930", 
                    "#text", 
                    "Fusce dapibus, tellus ac cursus commodo, tortor mauris nibh."
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "932", 
                    "p", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "933", 
                     "class", 
                     "text-primary"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "934", 
                     "#text", 
                     "Nullam id dolor id nibh ultricies vehicula ut id elit."
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "936", 
                     "p", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "937", 
                      "class", 
                      "text-warning"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "938", 
                      "#text", 
                      "Etiam porta sem malesuada magna mollis euismod."
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "940", 
                      "p", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "941", 
                       "class", 
                       "text-danger"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "942", 
                       "#text", 
                       "Donec ullamcorper nulla non metus auctor fringilla."
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "944", 
                       "p", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "945", 
                        "class", 
                        "text-success"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "946", 
                        "#text", 
                        "Duis mollis, est non commodo luctus, nisi erat porttitor ligula."
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "948", 
                        "p", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "949", 
                         "class", 
                         "text-info"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "950", 
                         "#text", 
                         "Maecenas sed diam eget risus varius blandit sit amet non magna."
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                )
               )
              )
             ), 
             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
              "955", 
              "#comment", 
              "Blockquotes", 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "957", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "958", 
                "class", 
                "row"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "960", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "961", 
                 "class", 
                 "col-lg-12"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                 "963", 
                 "h2", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "964", 
                  "id", 
                  "type-blockquotes"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "965", 
                  "#text", 
                  "Blockquotes"
                 )
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "969", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "970", 
                 "class", 
                 "row"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "972", 
                 "div", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "973", 
                  "class", 
                  "col-lg-4"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "975", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "976", 
                   "class", 
                   "bs-component"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "978", 
                   "blockquote", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "979", 
                    "class", 
                    "blockquote"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "981", 
                    "p", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "982", 
                     "class", 
                     "mb-0"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "983", 
                     "#text", 
                     "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer posuere erat a ante."
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "985", 
                     "footer", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "986", 
                      "class", 
                      "blockquote-footer"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                      "987", 
                      "#text", 
                      "Someone famous in", 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "988", 
                       "cite", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "989", 
                        "title", 
                        "Source Title"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "990", 
                        "#text", 
                        "Source Title"
                       )
                      )
                     )
                    )
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "994", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "995", 
                   "class", 
                   "col-lg-4"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "997", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "998", 
                    "class", 
                    "bs-component"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "1000", 
                    "blockquote", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1001", 
                     "class", 
                     "blockquote text-center"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "1003", 
                     "p", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1004", 
                      "class", 
                      "mb-0"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1005", 
                      "#text", 
                      "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer posuere erat a ante."
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                      "1007", 
                      "footer", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1008", 
                       "class", 
                       "blockquote-footer"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "1009", 
                       "#text", 
                       "Someone famous in", 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "1010", 
                        "cite", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1011", 
                         "title", 
                         "Source Title"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1012", 
                         "#text", 
                         "Source Title"
                        )
                       )
                      )
                     )
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "1016", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "1017", 
                    "class", 
                    "col-lg-4"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "1019", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1020", 
                     "class", 
                     "bs-component"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "1022", 
                     "blockquote", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1023", 
                      "class", 
                      "blockquote text-right"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "1025", 
                      "p", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1026", 
                       "class", 
                       "mb-0"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1027", 
                       "#text", 
                       "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer posuere erat a ante."
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "1029", 
                       "footer", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1030", 
                        "class", 
                        "blockquote-footer"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "1031", 
                        "#text", 
                        "Someone famous in", 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "1032", 
                         "cite", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1033", 
                          "title", 
                          "Source Title"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1034", 
                          "#text", 
                          "Source Title"
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                )
               )
              )
             )
            )
           )
          ), 
          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
           "1040", 
           "#comment", 
           "Tables      ==================================================", 
           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
            "1042", 
            "div", 
            Новый Структура("КодУзла, ИмяУзла, Содержимое",
             "1043", 
             "class", 
             "bs-docs-section"
            ), 
            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
             "1045", 
             "div", 
             Новый Структура("КодУзла, ИмяУзла, Содержимое",
              "1046", 
              "class", 
              "row"
             ), 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
              "1048", 
              "div", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "1049", 
               "class", 
               "col-lg-12"
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "1051", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "1052", 
                "class", 
                "page-header"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "1054", 
                "h1", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "1055", 
                 "id", 
                 "tables"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "1056", 
                 "#text", 
                 "Tables"
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "1059", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "1060", 
                 "class", 
                 "bs-component"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                 "1062", 
                 "table", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "1063", 
                  "class", 
                  "table table-striped table-hover table-bordered"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "1064", 
                  "thead", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "1065", 
                   "class", 
                   "thead-dark"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                   "1066", 
                   "tr", 
                   Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                    "1067", 
                    "th", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1068", 
                     "#text", 
                     "#"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                     "1070", 
                     "th", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1071", 
                      "#text", 
                      "Column heading"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                      "1073", 
                      "th", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1074", 
                       "#text", 
                       "Column heading"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                       "1076", 
                       "th", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1077", 
                        "#text", 
                        "Column heading"
                       )
                      )
                     )
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                   "1079", 
                   "tbody", 
                   Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                    "1080", 
                    "tr", 
                    Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                     "1081", 
                     "td", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1082", 
                      "#text", 
                      "1"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                      "1084", 
                      "td", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1085", 
                       "#text", 
                       "Column content"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                       "1087", 
                       "td", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1088", 
                        "#text", 
                        "Column content"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                        "1090", 
                        "td", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1091", 
                         "#text", 
                         "Column content"
                        )
                       )
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                     "1093", 
                     "tr", 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                      "1094", 
                      "td", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1095", 
                       "#text", 
                       "2"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                       "1097", 
                       "td", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1098", 
                        "#text", 
                        "Column content"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                        "1100", 
                        "td", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1101", 
                         "#text", 
                         "Column content"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                         "1103", 
                         "td", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1104", 
                          "#text", 
                          "Column content"
                         )
                        )
                       )
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "1106", 
                      "tr", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1107", 
                       "class", 
                       "table-info"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                       "1108", 
                       "td", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1109", 
                        "#text", 
                        "3"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                        "1111", 
                        "td", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1112", 
                         "#text", 
                         "Column content"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                         "1114", 
                         "td", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1115", 
                          "#text", 
                          "Column content"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                          "1117", 
                          "td", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1118", 
                           "#text", 
                           "Column content"
                          )
                         )
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "1120", 
                       "tr", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1121", 
                        "class", 
                        "table-success"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                        "1122", 
                        "td", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1123", 
                         "#text", 
                         "4"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                         "1125", 
                         "td", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1126", 
                          "#text", 
                          "Column content"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                          "1128", 
                          "td", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1129", 
                           "#text", 
                           "Column content"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                           "1131", 
                           "td", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1132", 
                            "#text", 
                            "Column content"
                           )
                          )
                         )
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1134", 
                        "tr", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1135", 
                         "class", 
                         "table-danger"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                         "1136", 
                         "td", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1137", 
                          "#text", 
                          "5"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                          "1139", 
                          "td", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1140", 
                           "#text", 
                           "Column content"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                           "1142", 
                           "td", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1143", 
                            "#text", 
                            "Column content"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                            "1145", 
                            "td", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1146", 
                             "#text", 
                             "Column content"
                            )
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1148", 
                         "tr", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1149", 
                          "class", 
                          "table-warning"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                          "1150", 
                          "td", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1151", 
                           "#text", 
                           "6"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                           "1153", 
                           "td", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1154", 
                            "#text", 
                            "Column content"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                            "1156", 
                            "td", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1157", 
                             "#text", 
                             "Column content"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                             "1159", 
                             "td", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1160", 
                              "#text", 
                              "Column content"
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1162", 
                          "tr", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1163", 
                           "class", 
                           "table-active"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                           "1164", 
                           "td", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1165", 
                            "#text", 
                            "7"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                            "1167", 
                            "td", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1168", 
                             "#text", 
                             "Column content"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                             "1170", 
                             "td", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1171", 
                              "#text", 
                              "Column content"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                              "1173", 
                              "td", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1174", 
                               "#text", 
                               "Column content"
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "1176", 
                 "#comment", 
                 "/example"
                )
               )
              )
             )
            ), 
            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
             "1181", 
             "#comment", 
             "Forms      ==================================================", 
             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
              "1183", 
              "div", 
              Новый Структура("КодУзла, ИмяУзла, Содержимое",
               "1184", 
               "class", 
               "bs-docs-section"
              ), 
              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
               "1186", 
               "div", 
               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                "1187", 
                "class", 
                "row"
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "1189", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "1190", 
                 "class", 
                 "col-lg-12"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                 "1192", 
                 "div", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "1193", 
                  "class", 
                  "page-header"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "1195", 
                  "h1", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "1196", 
                   "id", 
                   "forms"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "1197", 
                   "#text", 
                   "Forms"
                  )
                 )
                )
               ), 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                "1202", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "1203", 
                 "class", 
                 "row"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "1205", 
                 "div", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "1206", 
                  "class", 
                  "col-lg-6"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "1208", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "1209", 
                   "class", 
                   "bs-component"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                   "1211", 
                   "form", 
                   Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                    "1213", 
                    "fieldset", 
                    Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                     "1214", 
                     "legend", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1215", 
                      "#text", 
                      "Legend"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "1217", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1218", 
                       "class", 
                       "form-group row"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "1220", 
                       "label", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "1221", 
                        "for", 
                        "staticEmail", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1222", 
                         "class", 
                         "col-sm-2 col-form-label"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1223", 
                        "#text", 
                        "Email"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "1225", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1226", 
                         "class", 
                         "col-sm-10"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                         "1228", 
                         "input", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1229", 
                          "type", 
                          "text", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1230", 
                           "readonly", 
                           "readonly", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1231", 
                            "class", 
                            "form-control-plaintext", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1232", 
                             "id", 
                             "staticEmail", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1233", 
                              "value", 
                              "email@example.com"
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "1236", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1237", 
                        "class", 
                        "form-group"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1239", 
                        "label", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1240", 
                         "for", 
                         "exampleInputEmail1"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1241", 
                         "#text", 
                         "Email address"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                         "1243", 
                         "input", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1244", 
                          "type", 
                          "email", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1245", 
                           "class", 
                           "form-control", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1246", 
                            "id", 
                            "exampleInputEmail1", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1247", 
                             "aria_describedby", 
                             "emailHelp", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1248", 
                              "placeholder", 
                              "Enter email"
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1249", 
                          "small", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1250", 
                           "id", 
                           "emailHelp", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1251", 
                            "class", 
                            "form-text text-muted"
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1252", 
                           "#text", 
                           "We'll never share your email with anyone else."
                          )
                         )
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1255", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1256", 
                         "class", 
                         "form-group"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1258", 
                         "label", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1259", 
                          "for", 
                          "exampleInputPassword1"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1260", 
                          "#text", 
                          "Password"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                          "1262", 
                          "input", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1263", 
                           "type", 
                           "password", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1264", 
                            "class", 
                            "form-control", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1265", 
                             "id", 
                             "exampleInputPassword1", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1266", 
                              "placeholder", 
                              "Password"
                             )
                            )
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1268", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1269", 
                          "class", 
                          "form-group"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "1271", 
                          "label", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1272", 
                           "for", 
                           "exampleSelect1"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1273", 
                           "#text", 
                           "Example select"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1275", 
                           "select", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1276", 
                            "class", 
                            "form-control", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1277", 
                             "id", 
                             "exampleSelect1"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                            "1278", 
                            "option", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1279", 
                             "#text", 
                             "1"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                             "1280", 
                             "option", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1281", 
                              "#text", 
                              "2"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                              "1282", 
                              "option", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1283", 
                               "#text", 
                               "3"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                               "1284", 
                               "option", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1285", 
                                "#text", 
                                "4"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                                "1286", 
                                "option", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1287", 
                                 "#text", 
                                 "5"
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "1289", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1290", 
                           "class", 
                           "form-group"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "1292", 
                           "label", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1293", 
                            "for", 
                            "exampleSelect2"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1294", 
                            "#text", 
                            "Example multiple select"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "1296", 
                            "select", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1297", 
                             "multiple", 
                             "multiple", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1298", 
                              "class", 
                              "form-control", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1299", 
                               "id", 
                               "exampleSelect2"
                              )
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                             "1300", 
                             "option", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1301", 
                              "#text", 
                              "1"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                              "1302", 
                              "option", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1303", 
                               "#text", 
                               "2"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                               "1304", 
                               "option", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1305", 
                                "#text", 
                                "3"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                                "1306", 
                                "option", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1307", 
                                 "#text", 
                                 "4"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                                 "1308", 
                                 "option", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1309", 
                                  "#text", 
                                  "5"
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "1311", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1312", 
                            "class", 
                            "form-group"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "1314", 
                            "label", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1315", 
                             "for", 
                             "exampleTextarea"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1316", 
                             "#text", 
                             "Example textarea"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                             "1318", 
                             "textarea", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1319", 
                              "class", 
                              "form-control", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1320", 
                               "id", 
                               "exampleTextarea", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1321", 
                                "rows", 
                                "3"
                               )
                              )
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "1323", 
                            "div", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1324", 
                             "class", 
                             "form-group"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "1326", 
                             "label", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1327", 
                              "for", 
                              "exampleInputFile"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1328", 
                              "#text", 
                              "File input"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                              "1330", 
                              "input", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1331", 
                               "type", 
                               "file", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "1332", 
                                "class", 
                                "form-control-file", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "1333", 
                                 "id", 
                                 "exampleInputFile", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1334", 
                                  "aria_describedby", 
                                  "fileHelp"
                                 )
                                )
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "1335", 
                               "small", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "1336", 
                                "id", 
                                "fileHelp", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1337", 
                                 "class", 
                                 "form-text text-muted"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1338", 
                                "#text", 
                                "This is some placeholder block-level help text for the above input. It's a bit lighter and easily wraps to a new line."
                               )
                              )
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "1341", 
                             "fieldset", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1342", 
                              "class", 
                              "form-group"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                              "1343", 
                              "legend", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1344", 
                               "#text", 
                               "Radio buttons"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "1346", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1347", 
                                "class", 
                                "form-check"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "1349", 
                                "label", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1350", 
                                 "class", 
                                 "form-check-label"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                 "1352", 
                                 "input", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "1353", 
                                  "type", 
                                  "radio", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "1354", 
                                   "class", 
                                   "form-check-input", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "1355", 
                                    "name", 
                                    "optionsRadios", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "1356", 
                                     "id", 
                                     "optionsRadios1", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "1357", 
                                      "value", 
                                      "option1", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "1358", 
                                       "checked", 
                                       "checked"
                                      )
                                     )
                                    )
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1359", 
                                  "#text", 
                                  "Option one is this and that—be sure to include why it's great"
                                 )
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "1362", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1363", 
                                 "class", 
                                 "form-check"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "1365", 
                                 "label", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1366", 
                                  "class", 
                                  "form-check-label"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                  "1368", 
                                  "input", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "1369", 
                                   "type", 
                                   "radio", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "1370", 
                                    "class", 
                                    "form-check-input", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "1371", 
                                     "name", 
                                     "optionsRadios", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "1372", 
                                      "id", 
                                      "optionsRadios2", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "1373", 
                                       "value", 
                                       "option2"
                                      )
                                     )
                                    )
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "1374", 
                                   "#text", 
                                   "Option two can be something else and selecting it will deselect option one"
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "1377", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1378", 
                                  "class", 
                                  "form-check disabled"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "1380", 
                                  "label", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "1381", 
                                   "class", 
                                   "form-check-label"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                   "1383", 
                                   "input", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "1384", 
                                    "type", 
                                    "radio", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "1385", 
                                     "class", 
                                     "form-check-input", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "1386", 
                                      "name", 
                                      "optionsRadios", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "1387", 
                                       "id", 
                                       "optionsRadios3", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "1388", 
                                        "value", 
                                        "option3", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "1389", 
                                         "disabled", 
                                         "disabled"
                                        )
                                       )
                                      )
                                     )
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "1390", 
                                    "#text", 
                                    "Option three is disabled"
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "1393", 
                              "fieldset", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1394", 
                               "class", 
                               "form-group"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                               "1395", 
                               "legend", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1396", 
                                "#text", 
                                "Checkboxes"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "1398", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1399", 
                                 "class", 
                                 "form-check"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "1401", 
                                 "label", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1402", 
                                  "class", 
                                  "form-check-label"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                  "1404", 
                                  "input", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "1405", 
                                   "class", 
                                   "form-check-input", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "1406", 
                                    "type", 
                                    "checkbox", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "1407", 
                                     "value", 
                                     "", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "1408", 
                                      "checked", 
                                      "checked"
                                     )
                                    )
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "1409", 
                                   "#text", 
                                   "Option one is this and that—be sure to include why it's great"
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "1412", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1413", 
                                  "class", 
                                  "form-check disabled"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "1415", 
                                  "label", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "1416", 
                                   "class", 
                                   "form-check-label"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                   "1418", 
                                   "input", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "1419", 
                                    "class", 
                                    "form-check-input", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "1420", 
                                     "type", 
                                     "checkbox", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "1421", 
                                      "value", 
                                      "", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "1422", 
                                       "disabled", 
                                       "disabled"
                                      )
                                     )
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "1423", 
                                    "#text", 
                                    "Option two is disabled"
                                   )
                                  )
                                 )
                                )
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "1426", 
                               "button", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "1427", 
                                "type", 
                                "submit", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1428", 
                                 "class", 
                                 "btn btn-primary"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1429", 
                                "#text", 
                                "Submit"
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "1434", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "1435", 
                   "class", 
                   "col-lg-4 offset-lg-1"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "1437", 
                   "form", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "1438", 
                    "class", 
                    "bs-component"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "1440", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1441", 
                     "class", 
                     "form-group"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "1443", 
                     "fieldset", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1444", 
                      "disabled", 
                      "disabled"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "1445", 
                      "label", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "1446", 
                       "class", 
                       "control-label", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1447", 
                        "for", 
                        "disabledInput"
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1448", 
                       "#text", 
                       "Disabled input"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                       "1450", 
                       "input", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "1451", 
                        "class", 
                        "form-control", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "1452", 
                         "id", 
                         "disabledInput", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1453", 
                          "type", 
                          "text", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1454", 
                           "placeholder", 
                           "Disabled input here...", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1455", 
                            "disabled", 
                            ""
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "1457", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1458", 
                      "class", 
                      "form-group"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                      "1460", 
                      "fieldset", 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "1461", 
                       "label", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "1462", 
                        "class", 
                        "control-label", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1463", 
                         "for", 
                         "readOnlyInput"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1464", 
                        "#text", 
                        "Readonly input"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                        "1466", 
                        "input", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "1467", 
                         "class", 
                         "form-control", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1468", 
                          "id", 
                          "readOnlyInput", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1469", 
                           "type", 
                           "text", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1470", 
                            "placeholder", 
                            "Readonly input here…", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1471", 
                             "readonly", 
                             "readonly"
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "1473", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1474", 
                       "class", 
                       "form-group has-success"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "1476", 
                       "label", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "1477", 
                        "class", 
                        "form-control-label", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1478", 
                         "for", 
                         "inputSuccess1"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1479", 
                        "#text", 
                        "Valid input"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                        "1481", 
                        "input", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "1482", 
                         "type", 
                         "text", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1483", 
                          "value", 
                          "correct value", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1484", 
                           "class", 
                           "form-control is-valid", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1485", 
                            "id", 
                            "inputValid"
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "1486", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1487", 
                          "class", 
                          "valid-feedback"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1488", 
                          "#text", 
                          "Success! You've done it."
                         )
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "1491", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1492", 
                        "class", 
                        "form-group has-danger"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1494", 
                        "label", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "1495", 
                         "class", 
                         "form-control-label", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1496", 
                          "for", 
                          "inputDanger1"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1497", 
                         "#text", 
                         "Invalid input"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                         "1499", 
                         "input", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1500", 
                          "type", 
                          "text", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1501", 
                           "value", 
                           "wrong value", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1502", 
                            "class", 
                            "form-control is-invalid", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1503", 
                             "id", 
                             "inputInvalid"
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1504", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1505", 
                           "class", 
                           "invalid-feedback"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1506", 
                           "#text", 
                           "Sorry, that username's taken. Try another?"
                          )
                         )
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1509", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1510", 
                         "class", 
                         "form-group"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1512", 
                         "label", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1513", 
                          "class", 
                          "col-form-label col-form-label-lg", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1514", 
                           "for", 
                           "inputLarge"
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1515", 
                          "#text", 
                          "Large input"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                          "1517", 
                          "input", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1518", 
                           "class", 
                           "form-control form-control-lg", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1519", 
                            "type", 
                            "text", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1520", 
                             "placeholder", 
                             ".form-control-lg", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1521", 
                              "id", 
                              "inputLarge"
                             )
                            )
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1523", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1524", 
                          "class", 
                          "form-group"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "1526", 
                          "label", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1527", 
                           "class", 
                           "col-form-label", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1528", 
                            "for", 
                            "inputDefault"
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1529", 
                           "#text", 
                           "Default input"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                           "1531", 
                           "input", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1532", 
                            "type", 
                            "text", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1533", 
                             "class", 
                             "form-control", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1534", 
                              "placeholder", 
                              "Default input", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1535", 
                               "id", 
                               "inputDefault"
                              )
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "1537", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1538", 
                           "class", 
                           "form-group"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "1540", 
                           "label", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1541", 
                            "class", 
                            "col-form-label col-form-label-sm", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1542", 
                             "for", 
                             "inputSmall"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1543", 
                            "#text", 
                            "Small input"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                            "1545", 
                            "input", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1546", 
                             "class", 
                             "form-control form-control-sm", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1547", 
                              "type", 
                              "text", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1548", 
                               "placeholder", 
                               ".form-control-sm", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1549", 
                                "id", 
                                "inputSmall"
                               )
                              )
                             )
                            )
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1551", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1552", 
                            "class", 
                            "form-group"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "1554", 
                            "label", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1555", 
                             "class", 
                             "control-label"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1556", 
                             "#text", 
                             "Input addons"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "1558", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1559", 
                              "class", 
                              "form-group"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "1561", 
                              "label", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1562", 
                               "class", 
                               "sr-only", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1563", 
                                "for", 
                                "exampleInputAmount"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1564", 
                               "#text", 
                               "Amount (in dollars)"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "1566", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1567", 
                                "class", 
                                "input-group"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "1569", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1570", 
                                 "class", 
                                 "input-group-addon"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1571", 
                                 "#text", 
                                 "$"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                 "1573", 
                                 "input", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "1574", 
                                  "type", 
                                  "text", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "1575", 
                                   "class", 
                                   "form-control", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "1576", 
                                    "id", 
                                    "exampleInputAmount", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "1577", 
                                     "placeholder", 
                                     "Amount"
                                    )
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "1578", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "1579", 
                                   "class", 
                                   "input-group-addon"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "1580", 
                                   "#text", 
                                   ".00"
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "1586", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1587", 
                     "class", 
                     "bs-component"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                     "1589", 
                     "fieldset", 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                      "1590", 
                      "legend", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1591", 
                       "#text", 
                       "Custom forms"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "1593", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1594", 
                        "class", 
                        "form-group"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1596", 
                        "label", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1597", 
                         "class", 
                         "custom-control custom-radio"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                         "1599", 
                         "input", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1600", 
                          "id", 
                          "radio1", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1601", 
                           "name", 
                           "radio", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1602", 
                            "type", 
                            "radio", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1603", 
                             "class", 
                             "custom-control-input", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1604", 
                              "checked", 
                              "checked"
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                          "1605", 
                          "span", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1606", 
                           "class", 
                           "custom-control-indicator"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1608", 
                           "span", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1609", 
                            "class", 
                            "custom-control-description"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1610", 
                            "#text", 
                            "Toggle this custom radio"
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1613", 
                         "label", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1614", 
                          "class", 
                          "custom-control custom-radio"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                          "1616", 
                          "input", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1617", 
                           "id", 
                           "radio2", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1618", 
                            "name", 
                            "radio", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1619", 
                             "type", 
                             "radio", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1620", 
                              "class", 
                              "custom-control-input"
                             )
                            )
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                           "1621", 
                           "span", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1622", 
                            "class", 
                            "custom-control-indicator"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "1624", 
                            "span", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1625", 
                             "class", 
                             "custom-control-description"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1626", 
                             "#text", 
                             "Or toggle this other custom radio"
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1629", 
                          "label", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1630", 
                           "class", 
                           "custom-control custom-radio"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                           "1632", 
                           "input", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1633", 
                            "id", 
                            "radio3", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1634", 
                             "name", 
                             "radio", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1635", 
                              "type", 
                              "radio", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1636", 
                               "class", 
                               "custom-control-input", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1637", 
                                "disabled", 
                                "disabled"
                               )
                              )
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                            "1638", 
                            "span", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1639", 
                             "class", 
                             "custom-control-indicator"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "1641", 
                             "span", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1642", 
                              "class", 
                              "custom-control-description"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1643", 
                              "#text", 
                              "Disabled custom radio"
                             )
                            )
                           )
                          )
                         )
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1647", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1648", 
                         "class", 
                         "form-group"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1650", 
                         "label", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1651", 
                          "class", 
                          "custom-control custom-checkbox"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                          "1653", 
                          "input", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1654", 
                           "type", 
                           "checkbox", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1655", 
                            "class", 
                            "custom-control-input", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1656", 
                             "checked", 
                             "checked"
                            )
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                           "1657", 
                           "span", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1658", 
                            "class", 
                            "custom-control-indicator"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "1660", 
                            "span", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1661", 
                             "class", 
                             "custom-control-description"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1662", 
                             "#text", 
                             "Check this custom checkbox"
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1665", 
                          "label", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1666", 
                           "class", 
                           "custom-control custom-checkbox"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                           "1668", 
                           "input", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1669", 
                            "type", 
                            "checkbox", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1670", 
                             "class", 
                             "custom-control-input", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1671", 
                              "disabled", 
                              "disabled"
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                            "1672", 
                            "span", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1673", 
                             "class", 
                             "custom-control-indicator"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "1675", 
                             "span", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1676", 
                              "class", 
                              "custom-control-description"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1677", 
                              "#text", 
                              "Disabled custom checkbox"
                             )
                            )
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1681", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1682", 
                          "class", 
                          "form-group"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1684", 
                          "select", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1685", 
                           "class", 
                           "custom-select"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "1686", 
                           "option", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1687", 
                            "selected", 
                            "selected"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1688", 
                            "#text", 
                            "Open this select menu"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "1689", 
                            "option", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1690", 
                             "value", 
                             "1"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1691", 
                             "#text", 
                             "One"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "1692", 
                             "option", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1693", 
                              "value", 
                              "2"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1694", 
                              "#text", 
                              "Two"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "1695", 
                              "option", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1696", 
                               "value", 
                               "3"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1697", 
                               "#text", 
                               "Three"
                              )
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1699", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1700", 
                           "class", 
                           "form-group"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1702", 
                           "label", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1703", 
                            "class", 
                            "custom-file"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                            "1705", 
                            "input", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1706", 
                             "type", 
                             "file", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1707", 
                              "id", 
                              "file2", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1708", 
                               "class", 
                               "custom-file-input"
                              )
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                             "1709", 
                             "span", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1710", 
                              "class", 
                              "custom-file-control"
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                )
               )
              ), 
              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
               "1718", 
               "#comment", 
               "Navs      ==================================================", 
               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                "1720", 
                "div", 
                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                 "1721", 
                 "class", 
                 "bs-docs-section"
                ), 
                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                 "1723", 
                 "div", 
                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                  "1724", 
                  "class", 
                  "row"
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                  "1726", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "1727", 
                   "class", 
                   "col-lg-12"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "1729", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "1730", 
                    "class", 
                    "page-header"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "1732", 
                    "h1", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1733", 
                     "id", 
                     "navs"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1734", 
                     "#text", 
                     "Navs"
                    )
                   )
                  )
                 ), 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "1739", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "1740", 
                   "class", 
                   "row", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "1741", 
                    "style", 
                    "margin-bottom: 2rem;"
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "1743", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "1744", 
                    "class", 
                    "col-lg-6"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "1746", 
                    "h2", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1747", 
                     "id", 
                     "nav-tabs"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1748", 
                     "#text", 
                     "Tabs"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "1750", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1751", 
                      "class", 
                      "bs-component"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "1753", 
                      "ul", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1754", 
                       "class", 
                       "nav nav-tabs"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "1755", 
                       "li", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1756", 
                        "class", 
                        "nav-item"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "1758", 
                        "a", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "1759", 
                         "class", 
                         "nav-link active", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1760", 
                          "data_toggle", 
                          "tab", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1761", 
                           "href", 
                           "#home"
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1762", 
                         "#text", 
                         "Home"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1765", 
                        "li", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1766", 
                         "class", 
                         "nav-item"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "1768", 
                         "a", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1769", 
                          "class", 
                          "nav-link", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1770", 
                           "data_toggle", 
                           "tab", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1771", 
                            "href", 
                            "#profile"
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1772", 
                          "#text", 
                          "Profile"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1775", 
                         "li", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1776", 
                          "class", 
                          "nav-item"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1778", 
                          "a", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1779", 
                           "class", 
                           "nav-link disabled", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1780", 
                            "href", 
                            "#"
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1781", 
                           "#text", 
                           "Disabled"
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "1784", 
                          "li", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1785", 
                           "class", 
                           "nav-item dropdown"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "1787", 
                           "a", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1788", 
                            "class", 
                            "nav-link dropdown-toggle", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1789", 
                             "data_toggle", 
                             "dropdown", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1790", 
                              "href", 
                              "#", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1791", 
                               "role", 
                               "button", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "1792", 
                                "aria_haspopup", 
                                "true", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1793", 
                                 "aria_expanded", 
                                 "false"
                                )
                               )
                              )
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1794", 
                            "#text", 
                            "Dropdown"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "1796", 
                            "div", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1797", 
                             "class", 
                             "dropdown-menu"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "1799", 
                             "a", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1800", 
                              "class", 
                              "dropdown-item", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1801", 
                               "href", 
                               "#"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1802", 
                              "#text", 
                              "Action"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "1804", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1805", 
                               "class", 
                               "dropdown-item", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1806", 
                                "href", 
                                "#"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1807", 
                               "#text", 
                               "Another action"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "1809", 
                               "a", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "1810", 
                                "class", 
                                "dropdown-item", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1811", 
                                 "href", 
                                 "#"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1812", 
                                "#text", 
                                "Something else here"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                "1814", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1815", 
                                 "class", 
                                 "dropdown-divider"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "1817", 
                                 "a", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "1818", 
                                  "class", 
                                  "dropdown-item", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "1819", 
                                   "href", 
                                   "#"
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1820", 
                                  "#text", 
                                  "Separated link"
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "1824", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                        "1825", 
                        "id", 
                        "myTabContent", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1826", 
                         "class", 
                         "tab-content"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1828", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "1829", 
                         "class", 
                         "tab-pane fade show active", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1830", 
                          "id", 
                          "home"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                         "1832", 
                         "p", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1833", 
                          "#text", 
                          "Raw denim you probably haven't heard of them jean shorts Austin. Nesciunt tofu stumptown aliqua, retro synth master cleanse. Mustache cliche tempor, williamsburg carles vegan helvetica. Reprehenderit butcher retro keffiyeh dreamcatcher synth. Cosby sweater eu banh mi, qui irure terry richardson ex squid. Aliquip placeat salvia cillum iphone. Seitan aliquip quis cardigan american apparel, butcher voluptate nisi qui."
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1836", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1837", 
                          "class", 
                          "tab-pane fade", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1838", 
                           "id", 
                           "profile"
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                          "1840", 
                          "p", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1841", 
                           "#text", 
                           "Food truck fixie locavore, accusamus mcsweeney's marfa nulla single-origin coffee squid. Exercitation +1 labore velit, blog sartorial PBR leggings next level wes anderson artisan four loko farm-to-table craft beer twee. Qui photo booth letterpress, commodo enim craft beer mlkshk aliquip jean shorts ullamco ad vinyl cillum PBR. Homo nostrud organic, assumenda labore aesthetic magna delectus mollit."
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "1844", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1845", 
                           "class", 
                           "tab-pane fade", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1846", 
                            "id", 
                            "dropdown1"
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                           "1848", 
                           "p", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1849", 
                            "#text", 
                            "Etsy mixtape wayfarers, ethical wes anderson tofu before they sold out mcsweeney's organic lomo retro fanny pack lo-fi farm-to-table readymade. Messenger bag gentrify pitchfork tattooed craft beer, iphone skateboard locavore carles etsy salvia banksy hoodie helvetica. DIY synth PBR banksy irony. Leggings gentrify squid 8-bit cred pitchfork."
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1852", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1853", 
                            "class", 
                            "tab-pane fade", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1854", 
                             "id", 
                             "dropdown2"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                            "1856", 
                            "p", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1857", 
                             "#text", 
                             "Trust fund seitan letterpress, keytar raw denim keffiyeh etsy art party before they sold out master cleanse gluten-free squid scenester freegan cosby sweater. Fanny pack portland seitan DIY, art party locavore wolf cliche high life echo park Austin. Cred vinyl keffiyeh DIY salvia PBR, banh mi before they sold out farm-to-table VHS viral locavore cosby sweater."
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "1863", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "1864", 
                     "class", 
                     "col-lg-6"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "1866", 
                     "h2", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1867", 
                      "id", 
                      "nav-pills"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "1868", 
                      "#text", 
                      "Pills"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "1870", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "1871", 
                       "class", 
                       "bs-component"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "1873", 
                       "ul", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "1874", 
                        "class", 
                        "nav nav-pills"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "1875", 
                        "li", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1876", 
                         "class", 
                         "nav-item"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "1878", 
                         "a", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "1879", 
                          "class", 
                          "nav-link active", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1880", 
                           "href", 
                           "#"
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1881", 
                          "#text", 
                          "Active"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "1884", 
                         "li", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1885", 
                          "class", 
                          "nav-item dropdown"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "1887", 
                          "a", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "1888", 
                           "class", 
                           "nav-link dropdown-toggle", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1889", 
                            "data_toggle", 
                            "dropdown", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1890", 
                             "href", 
                             "#", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1891", 
                              "role", 
                              "button", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1892", 
                               "aria_haspopup", 
                               "true", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1893", 
                                "aria_expanded", 
                                "false"
                               )
                              )
                             )
                            )
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1894", 
                           "#text", 
                           "Dropdown"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1896", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1897", 
                            "class", 
                            "dropdown-menu"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "1899", 
                            "a", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1900", 
                             "class", 
                             "dropdown-item", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1901", 
                              "href", 
                              "#"
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1902", 
                             "#text", 
                             "Action"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "1904", 
                             "a", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1905", 
                              "class", 
                              "dropdown-item", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1906", 
                               "href", 
                               "#"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1907", 
                              "#text", 
                              "Another action"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "1909", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1910", 
                               "class", 
                               "dropdown-item", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1911", 
                                "href", 
                                "#"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1912", 
                               "#text", 
                               "Something else here"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                               "1914", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1915", 
                                "class", 
                                "dropdown-divider"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "1917", 
                                "a", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "1918", 
                                 "class", 
                                 "dropdown-item", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1919", 
                                  "href", 
                                  "#"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1920", 
                                 "#text", 
                                 "Separated link"
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "1924", 
                          "li", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1925", 
                           "class", 
                           "nav-item"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1927", 
                           "a", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1928", 
                            "class", 
                            "nav-link", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1929", 
                             "href", 
                             "#"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1930", 
                            "#text", 
                            "Link"
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1933", 
                           "li", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1934", 
                            "class", 
                            "nav-item"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "1936", 
                            "a", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1937", 
                             "class", 
                             "nav-link disabled", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1938", 
                              "href", 
                              "#"
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1939", 
                             "#text", 
                             "Disabled"
                            )
                           )
                          )
                         )
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, СоседнийУзел",
                       "1943", 
                       "br", 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "1944", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "1945", 
                         "class", 
                         "bs-component"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "1947", 
                         "ul", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "1948", 
                          "class", 
                          "nav nav-pills flex-column"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "1949", 
                          "li", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "1950", 
                           "class", 
                           "nav-item"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "1952", 
                           "a", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "1953", 
                            "class", 
                            "nav-link active", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1954", 
                             "href", 
                             "#"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1955", 
                            "#text", 
                            "Active"
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "1958", 
                           "li", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "1959", 
                            "class", 
                            "nav-item dropdown"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "1961", 
                            "a", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "1962", 
                             "class", 
                             "nav-link dropdown-toggle", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "1963", 
                              "data_toggle", 
                              "dropdown", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1964", 
                               "href", 
                               "#", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "1965", 
                                "role", 
                                "button", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "1966", 
                                 "aria_haspopup", 
                                 "true", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1967", 
                                  "aria_expanded", 
                                  "false"
                                 )
                                )
                               )
                              )
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1968", 
                             "#text", 
                             "Dropdown"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "1970", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "1971", 
                              "class", 
                              "dropdown-menu"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "1973", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "1974", 
                               "class", 
                               "dropdown-item", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1975", 
                                "href", 
                                "#"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "1976", 
                               "#text", 
                               "Action"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "1978", 
                               "a", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "1979", 
                                "class", 
                                "dropdown-item", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1980", 
                                 "href", 
                                 "#"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "1981", 
                                "#text", 
                                "Another action"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "1983", 
                                "a", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "1984", 
                                 "class", 
                                 "dropdown-item", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1985", 
                                  "href", 
                                  "#"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "1986", 
                                 "#text", 
                                 "Something else here"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                 "1988", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "1989", 
                                  "class", 
                                  "dropdown-divider"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "1991", 
                                  "a", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "1992", 
                                   "class", 
                                   "dropdown-item", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "1993", 
                                    "href", 
                                    "#"
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "1994", 
                                   "#text", 
                                   "Separated link"
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "1998", 
                            "li", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "1999", 
                             "class", 
                             "nav-item"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "2001", 
                             "a", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2002", 
                              "class", 
                              "nav-link", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2003", 
                               "href", 
                               "#"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2004", 
                              "#text", 
                              "Link"
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "2007", 
                             "li", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2008", 
                              "class", 
                              "nav-item"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "2010", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2011", 
                               "class", 
                               "nav-link disabled", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2012", 
                                "href", 
                                "#"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2013", 
                               "#text", 
                               "Disabled"
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                   "2019", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "2020", 
                    "class", 
                    "row"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "2022", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "2023", 
                     "class", 
                     "col-lg-6"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "2025", 
                     "h2", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "2026", 
                      "id", 
                      "nav-breadcrumbs"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "2027", 
                      "#text", 
                      "Breadcrumbs"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                      "2029", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2030", 
                       "class", 
                       "bs-component"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "2032", 
                       "ol", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "2033", 
                        "class", 
                        "breadcrumb"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "2034", 
                        "li", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2035", 
                         "class", 
                         "breadcrumb-item active"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2036", 
                         "#text", 
                         "Home"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "2038", 
                        "ol", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2039", 
                         "class", 
                         "breadcrumb"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "2040", 
                         "li", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2041", 
                          "class", 
                          "breadcrumb-item"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "2042", 
                          "a", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2043", 
                           "href", 
                           "#"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2044", 
                           "#text", 
                           "Home"
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "2046", 
                          "li", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2047", 
                           "class", 
                           "breadcrumb-item active"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2048", 
                           "#text", 
                           "Library"
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "2050", 
                         "ol", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2051", 
                          "class", 
                          "breadcrumb"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2052", 
                          "li", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2053", 
                           "class", 
                           "breadcrumb-item"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "2054", 
                           "a", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2055", 
                            "href", 
                            "#"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2056", 
                            "#text", 
                            "Home"
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2058", 
                           "li", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2059", 
                            "class", 
                            "breadcrumb-item"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "2060", 
                            "a", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2061", 
                             "href", 
                             "#"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2062", 
                             "#text", 
                             "Library"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "2064", 
                            "li", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2065", 
                             "class", 
                             "breadcrumb-item active"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2066", 
                             "#text", 
                             "Data"
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "2070", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "2071", 
                      "class", 
                      "col-lg-6"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "2073", 
                      "h2", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2074", 
                       "id", 
                       "pagination"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2075", 
                       "#text", 
                       "Pagination"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "2077", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "2078", 
                        "class", 
                        "bs-component"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                        "2080", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "2082", 
                         "ul", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2083", 
                          "class", 
                          "pagination"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2084", 
                          "li", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2085", 
                           "class", 
                           "page-item disabled"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "2087", 
                           "a", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "2088", 
                            "class", 
                            "page-link", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2089", 
                             "href", 
                             "#"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2090", 
                            "#text", 
                            "«"
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2093", 
                           "li", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2094", 
                            "class", 
                            "page-item active"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "2096", 
                            "a", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "2097", 
                             "class", 
                             "page-link", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2098", 
                              "href", 
                              "#"
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2099", 
                             "#text", 
                             "1"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2102", 
                            "li", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2103", 
                             "class", 
                             "page-item"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "2105", 
                             "a", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2106", 
                              "class", 
                              "page-link", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2107", 
                               "href", 
                               "#"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2108", 
                              "#text", 
                              "2"
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2111", 
                             "li", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2112", 
                              "class", 
                              "page-item"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "2114", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2115", 
                               "class", 
                               "page-link", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2116", 
                                "href", 
                                "#"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2117", 
                               "#text", 
                               "3"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2120", 
                              "li", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2121", 
                               "class", 
                               "page-item"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "2123", 
                               "a", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2124", 
                                "class", 
                                "page-link", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2125", 
                                 "href", 
                                 "#"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2126", 
                                "#text", 
                                "4"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2129", 
                               "li", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2130", 
                                "class", 
                                "page-item"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2132", 
                                "a", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2133", 
                                 "class", 
                                 "page-link", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2134", 
                                  "href", 
                                  "#"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2135", 
                                 "#text", 
                                 "5"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2138", 
                                "li", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2139", 
                                 "class", 
                                 "page-item"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2141", 
                                 "a", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2142", 
                                  "class", 
                                  "page-link", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2143", 
                                   "href", 
                                   "#"
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2144", 
                                  "#text", 
                                  "»"
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                         "2148", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "2150", 
                          "ul", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2151", 
                           "class", 
                           "pagination pagination-lg"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2152", 
                           "li", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2153", 
                            "class", 
                            "page-item disabled"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "2155", 
                            "a", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "2156", 
                             "class", 
                             "page-link", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2157", 
                              "href", 
                              "#"
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2158", 
                             "#text", 
                             "«"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2161", 
                            "li", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2162", 
                             "class", 
                             "page-item active"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "2164", 
                             "a", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2165", 
                              "class", 
                              "page-link", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2166", 
                               "href", 
                               "#"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2167", 
                              "#text", 
                              "1"
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2170", 
                             "li", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2171", 
                              "class", 
                              "page-item"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "2173", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2174", 
                               "class", 
                               "page-link", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2175", 
                                "href", 
                                "#"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2176", 
                               "#text", 
                               "2"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2179", 
                              "li", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2180", 
                               "class", 
                               "page-item"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "2182", 
                               "a", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2183", 
                                "class", 
                                "page-link", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2184", 
                                 "href", 
                                 "#"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2185", 
                                "#text", 
                                "3"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2188", 
                               "li", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2189", 
                                "class", 
                                "page-item"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2191", 
                                "a", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2192", 
                                 "class", 
                                 "page-link", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2193", 
                                  "href", 
                                  "#"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2194", 
                                 "#text", 
                                 "4"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "2197", 
                                "li", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2198", 
                                 "class", 
                                 "page-item"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2200", 
                                 "a", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2201", 
                                  "class", 
                                  "page-link", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2202", 
                                   "href", 
                                   "#"
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2203", 
                                  "#text", 
                                  "5"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2206", 
                                 "li", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2207", 
                                  "class", 
                                  "page-item"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "2209", 
                                  "a", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2210", 
                                   "class", 
                                   "page-link", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2211", 
                                    "href", 
                                    "#"
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2212", 
                                   "#text", 
                                   "»"
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                          "2216", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "2218", 
                           "ul", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2219", 
                            "class", 
                            "pagination pagination-sm"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2220", 
                            "li", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2221", 
                             "class", 
                             "page-item disabled"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "2223", 
                             "a", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2224", 
                              "class", 
                              "page-link", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2225", 
                               "href", 
                               "#"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2226", 
                              "#text", 
                              "«"
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2229", 
                             "li", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2230", 
                              "class", 
                              "page-item active"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "2232", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2233", 
                               "class", 
                               "page-link", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2234", 
                                "href", 
                                "#"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2235", 
                               "#text", 
                               "1"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2238", 
                              "li", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2239", 
                               "class", 
                               "page-item"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "2241", 
                               "a", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2242", 
                                "class", 
                                "page-link", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2243", 
                                 "href", 
                                 "#"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2244", 
                                "#text", 
                                "2"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2247", 
                               "li", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2248", 
                                "class", 
                                "page-item"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2250", 
                                "a", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2251", 
                                 "class", 
                                 "page-link", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2252", 
                                  "href", 
                                  "#"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2253", 
                                 "#text", 
                                 "3"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "2256", 
                                "li", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2257", 
                                 "class", 
                                 "page-item"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2259", 
                                 "a", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2260", 
                                  "class", 
                                  "page-link", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2261", 
                                   "href", 
                                   "#"
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2262", 
                                  "#text", 
                                  "4"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "2265", 
                                 "li", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2266", 
                                  "class", 
                                  "page-item"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "2268", 
                                  "a", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2269", 
                                   "class", 
                                   "page-link", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2270", 
                                    "href", 
                                    "#"
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2271", 
                                   "#text", 
                                   "5"
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "2274", 
                                  "li", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2275", 
                                   "class", 
                                   "page-item"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "2277", 
                                   "a", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2278", 
                                    "class", 
                                    "page-link", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "2279", 
                                     "href", 
                                     "#"
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2280", 
                                    "#text", 
                                    "»"
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                ), 
                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                 "2288", 
                 "#comment", 
                 "Indicators      ==================================================", 
                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                  "2290", 
                  "div", 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                   "2291", 
                   "class", 
                   "bs-docs-section"
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                   "2293", 
                   "div", 
                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                    "2294", 
                    "class", 
                    "row"
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                    "2296", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "2297", 
                     "class", 
                     "col-lg-12"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "2299", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "2300", 
                      "class", 
                      "page-header"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                      "2302", 
                      "h1", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2303", 
                       "id", 
                       "indicators"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2304", 
                       "#text", 
                       "Indicators"
                      )
                     )
                    )
                   ), 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "2309", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "2310", 
                     "class", 
                     "row"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "2312", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "2313", 
                      "class", 
                      "col-lg-12"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                      "2315", 
                      "h2", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2316", 
                       "#text", 
                       "Alerts"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "2318", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "2319", 
                        "class", 
                        "bs-component"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "2321", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2322", 
                         "class", 
                         "alert alert-dismissible alert-warning"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "2324", 
                         "button", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "2325", 
                          "type", 
                          "button", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "2326", 
                           "class", 
                           "close", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2327", 
                            "data_dismiss", 
                            "alert"
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2328", 
                          "#text", 
                          "×"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2330", 
                          "h4", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2331", 
                           "class", 
                           "alert-heading"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2332", 
                           "#text", 
                           "Warning!"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "2334", 
                           "p", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2335", 
                            "class", 
                            "mb-0"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "2336", 
                            "#text", 
                            "Best check yo self, you're not looking too good. Nulla vitae elit libero, a pharetra augue. Praesent commodo cursus magna,", 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2337", 
                             "a", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2338", 
                              "href", 
                              "#", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2339", 
                               "class", 
                               "alert-link"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2340", 
                              "#text", 
                              "vel scelerisque nisl consectetur et"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2341", 
                              "#text", 
                              "."
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                     "2347", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "2348", 
                      "class", 
                      "row"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "2350", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2351", 
                       "class", 
                       "col-lg-4"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                       "2353", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "2354", 
                        "class", 
                        "bs-component"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "2356", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2357", 
                         "class", 
                         "alert alert-dismissible alert-danger"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "2359", 
                         "button", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "2360", 
                          "type", 
                          "button", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "2361", 
                           "class", 
                           "close", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2362", 
                            "data_dismiss", 
                            "alert"
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2363", 
                          "#text", 
                          "×"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                          "2365", 
                          "strong", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2366", 
                           "#text", 
                           "Oh snap!"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2368", 
                           "a", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "2369", 
                            "href", 
                            "#", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2370", 
                             "class", 
                             "alert-link"
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2371", 
                            "#text", 
                            "Change a few things up"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2372", 
                            "#text", 
                            "and try submitting again."
                           )
                          )
                         )
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "2376", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "2377", 
                        "class", 
                        "col-lg-4"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "2379", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2380", 
                         "class", 
                         "bs-component"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "2382", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2383", 
                          "class", 
                          "alert alert-dismissible alert-success"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2385", 
                          "button", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                           "2386", 
                           "type", 
                           "button", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "2387", 
                            "class", 
                            "close", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2388", 
                             "data_dismiss", 
                             "alert"
                            )
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2389", 
                           "#text", 
                           "×"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                           "2391", 
                           "strong", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2392", 
                            "#text", 
                            "Well done!"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "2393", 
                            "#text", 
                            "You successfully read", 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2394", 
                             "a", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2395", 
                              "href", 
                              "#", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2396", 
                               "class", 
                               "alert-link"
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2397", 
                              "#text", 
                              "this important alert message"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2398", 
                              "#text", 
                              "."
                             )
                            )
                           )
                          )
                         )
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "2402", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2403", 
                         "class", 
                         "col-lg-4"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "2405", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2406", 
                          "class", 
                          "bs-component"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "2408", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2409", 
                           "class", 
                           "alert alert-dismissible alert-info"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2411", 
                           "button", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "2412", 
                            "type", 
                            "button", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "2413", 
                             "class", 
                             "close", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2414", 
                              "data_dismiss", 
                              "alert"
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2415", 
                            "#text", 
                            "×"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                            "2417", 
                            "strong", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2418", 
                             "#text", 
                             "Heads up!"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "2419", 
                             "#text", 
                             "This", 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2420", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2421", 
                               "href", 
                               "#", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2422", 
                                "class", 
                                "alert-link"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2423", 
                               "#text", 
                               "alert needs your attention"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2424", 
                               "#text", 
                               ", but it's not super important."
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                      "2429", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                       "2431", 
                       "h2", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "2432", 
                        "#text", 
                        "Badges"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "2434", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                         "2435", 
                         "class", 
                         "bs-component", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2436", 
                          "style", 
                          "margin-bottom: 40px;"
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "2438", 
                         "span", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2439", 
                          "class", 
                          "badge badge-primary"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2440", 
                          "#text", 
                          "Primary"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2442", 
                          "span", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2443", 
                           "class", 
                           "badge badge-secondary"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2444", 
                           "#text", 
                           "Secondary"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2446", 
                           "span", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2447", 
                            "class", 
                            "badge badge-success"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2448", 
                            "#text", 
                            "Success"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2450", 
                            "span", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2451", 
                             "class", 
                             "badge badge-danger"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2452", 
                             "#text", 
                             "Danger"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2454", 
                             "span", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2455", 
                              "class", 
                              "badge badge-warning"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2456", 
                              "#text", 
                              "Warning"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2458", 
                              "span", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2459", 
                               "class", 
                               "badge badge-info"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2460", 
                               "#text", 
                               "Info"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2462", 
                               "span", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2463", 
                                "class", 
                                "badge badge-light"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2464", 
                                "#text", 
                                "Light"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2466", 
                                "span", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2467", 
                                 "class", 
                                 "badge badge-dark"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2468", 
                                 "#text", 
                                 "Dark"
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "2471", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2472", 
                          "class", 
                          "bs-component"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2474", 
                          "span", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2475", 
                           "class", 
                           "badge badge-pill badge-primary"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2476", 
                           "#text", 
                           "Primary"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2478", 
                           "span", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2479", 
                            "class", 
                            "badge badge-pill badge-secondary"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2480", 
                            "#text", 
                            "Secondary"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2482", 
                            "span", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2483", 
                             "class", 
                             "badge badge-pill badge-success"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2484", 
                             "#text", 
                             "Success"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2486", 
                             "span", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2487", 
                              "class", 
                              "badge badge-pill badge-danger"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2488", 
                              "#text", 
                              "Danger"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2490", 
                              "span", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2491", 
                               "class", 
                               "badge badge-pill badge-warning"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2492", 
                               "#text", 
                               "Warning"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2494", 
                               "span", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2495", 
                                "class", 
                                "badge badge-pill badge-info"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2496", 
                                "#text", 
                                "Info"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "2498", 
                                "span", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2499", 
                                 "class", 
                                 "badge badge-pill badge-light"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2500", 
                                 "#text", 
                                 "Light"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2502", 
                                 "span", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2503", 
                                  "class", 
                                  "badge badge-pill badge-dark"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2504", 
                                  "#text", 
                                  "Dark"
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  ), 
                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                   "2509", 
                   "#comment", 
                   "Progress      ==================================================", 
                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                    "2511", 
                    "div", 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                     "2512", 
                     "class", 
                     "bs-docs-section"
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                     "2514", 
                     "div", 
                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                      "2515", 
                      "class", 
                      "row"
                     ), 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                      "2517", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2518", 
                       "class", 
                       "col-lg-12"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "2520", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "2521", 
                        "class", 
                        "page-header"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "2523", 
                        "h1", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2524", 
                         "id", 
                         "progress"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2525", 
                         "#text", 
                         "Progress"
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "2528", 
                        "h3", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2529", 
                         "id", 
                         "progress-basic"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2530", 
                         "#text", 
                         "Basic"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "2532", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2533", 
                          "class", 
                          "bs-component"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "2535", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2536", 
                           "class", 
                           "progress"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                           "2538", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                            "2539", 
                            "class", 
                            "progress-bar", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                             "2540", 
                             "role", 
                             "progressbar", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2541", 
                              "style", 
                              "width: 25%;", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2542", 
                               "aria_valuenow", 
                               "25", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2543", 
                                "aria_valuemin", 
                                "0", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2544", 
                                 "aria_valuemax", 
                                 "100"
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2548", 
                          "h3", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2549", 
                           "id", 
                           "progress-alternatives"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2550", 
                           "#text", 
                           "Contextual alternatives"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2552", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2553", 
                            "class", 
                            "bs-component"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2555", 
                            "div", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2556", 
                             "class", 
                             "progress"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                             "2558", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2559", 
                              "class", 
                              "progress-bar bg-success", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2560", 
                               "role", 
                               "progressbar", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2561", 
                                "style", 
                                "width: 25%", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2562", 
                                 "aria_valuenow", 
                                 "25", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2563", 
                                  "aria_valuemin", 
                                  "0", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2564", 
                                   "aria_valuemax", 
                                   "100"
                                  )
                                 )
                                )
                               )
                              )
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2567", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2568", 
                              "class", 
                              "progress"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                              "2570", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2571", 
                               "class", 
                               "progress-bar bg-info", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2572", 
                                "role", 
                                "progressbar", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2573", 
                                 "style", 
                                 "width: 50%", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2574", 
                                  "aria_valuenow", 
                                  "50", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2575", 
                                   "aria_valuemin", 
                                   "0", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2576", 
                                    "aria_valuemax", 
                                    "100"
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2579", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2580", 
                               "class", 
                               "progress"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                               "2582", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2583", 
                                "class", 
                                "progress-bar bg-warning", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2584", 
                                 "role", 
                                 "progressbar", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2585", 
                                  "style", 
                                  "width: 75%", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2586", 
                                   "aria_valuenow", 
                                   "75", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2587", 
                                    "aria_valuemin", 
                                    "0", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "2588", 
                                     "aria_valuemax", 
                                     "100"
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "2591", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2592", 
                                "class", 
                                "progress"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                                "2594", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2595", 
                                 "class", 
                                 "progress-bar bg-danger", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2596", 
                                  "role", 
                                  "progressbar", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2597", 
                                   "style", 
                                   "width: 100%", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2598", 
                                    "aria_valuenow", 
                                    "100", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "2599", 
                                     "aria_valuemin", 
                                     "0", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "2600", 
                                      "aria_valuemax", 
                                      "100"
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2604", 
                            "h3", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2605", 
                             "id", 
                             "progress-multiple"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2606", 
                             "#text", 
                             "Multiple bars"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2608", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2609", 
                              "class", 
                              "bs-component"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "2611", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2612", 
                               "class", 
                               "progress"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                               "2614", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2615", 
                                "class", 
                                "progress-bar", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2616", 
                                 "role", 
                                 "progressbar", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2617", 
                                  "style", 
                                  "width: 15%", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2618", 
                                   "aria_valuenow", 
                                   "15", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2619", 
                                    "aria_valuemin", 
                                    "0", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "2620", 
                                     "aria_valuemax", 
                                     "100"
                                    )
                                   )
                                  )
                                 )
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                "2622", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2623", 
                                 "class", 
                                 "progress-bar bg-success", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2624", 
                                  "role", 
                                  "progressbar", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2625", 
                                   "style", 
                                   "width: 30%", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2626", 
                                    "aria_valuenow", 
                                    "30", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "2627", 
                                     "aria_valuemin", 
                                     "0", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "2628", 
                                      "aria_valuemax", 
                                      "100"
                                     )
                                    )
                                   )
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                                 "2630", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2631", 
                                  "class", 
                                  "progress-bar bg-info", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2632", 
                                   "role", 
                                   "progressbar", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2633", 
                                    "style", 
                                    "width: 20%", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "2634", 
                                     "aria_valuenow", 
                                     "20", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "2635", 
                                      "aria_valuemin", 
                                      "0", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "2636", 
                                       "aria_valuemax", 
                                       "100"
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2640", 
                              "h3", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2641", 
                               "id", 
                               "progress-striped"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2642", 
                               "#text", 
                               "Striped"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2644", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2645", 
                                "class", 
                                "bs-component"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "2647", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2648", 
                                 "class", 
                                 "progress"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                                 "2650", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2651", 
                                  "class", 
                                  "progress-bar progress-bar-striped", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2652", 
                                   "role", 
                                   "progressbar", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2653", 
                                    "style", 
                                    "width: 10%", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "2654", 
                                     "aria_valuenow", 
                                     "10", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "2655", 
                                      "aria_valuemin", 
                                      "0", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "2656", 
                                       "aria_valuemax", 
                                       "100"
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "2659", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2660", 
                                  "class", 
                                  "progress"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                                  "2662", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2663", 
                                   "class", 
                                   "progress-bar progress-bar-striped bg-success", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2664", 
                                    "role", 
                                    "progressbar", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "2665", 
                                     "style", 
                                     "width: 25%", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "2666", 
                                      "aria_valuenow", 
                                      "25", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "2667", 
                                       "aria_valuemin", 
                                       "0", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "2668", 
                                        "aria_valuemax", 
                                        "100"
                                       )
                                      )
                                     )
                                    )
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "2671", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2672", 
                                   "class", 
                                   "progress"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                                   "2674", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2675", 
                                    "class", 
                                    "progress-bar progress-bar-striped bg-info", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "2676", 
                                     "role", 
                                     "progressbar", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "2677", 
                                      "style", 
                                      "width: 50%", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "2678", 
                                       "aria_valuenow", 
                                       "50", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "2679", 
                                        "aria_valuemin", 
                                        "0", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "2680", 
                                         "aria_valuemax", 
                                         "100"
                                        )
                                       )
                                      )
                                     )
                                    )
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "2683", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2684", 
                                    "class", 
                                    "progress"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                                    "2686", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "2687", 
                                     "class", 
                                     "progress-bar progress-bar-striped bg-warning", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "2688", 
                                      "role", 
                                      "progressbar", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "2689", 
                                       "style", 
                                       "width: 75%", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "2690", 
                                        "aria_valuenow", 
                                        "75", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                         "2691", 
                                         "aria_valuemin", 
                                         "0", 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                          "2692", 
                                          "aria_valuemax", 
                                          "100"
                                         )
                                        )
                                       )
                                      )
                                     )
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                    "2695", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "2696", 
                                     "class", 
                                     "progress"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                                     "2698", 
                                     "div", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "2699", 
                                      "class", 
                                      "progress-bar progress-bar-striped bg-danger", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "2700", 
                                       "role", 
                                       "progressbar", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "2701", 
                                        "style", 
                                        "width: 100%", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                         "2702", 
                                         "aria_valuenow", 
                                         "100", 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                          "2703", 
                                          "aria_valuemin", 
                                          "0", 
                                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                           "2704", 
                                           "aria_valuemax", 
                                           "100"
                                          )
                                         )
                                        )
                                       )
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "2708", 
                                "h3", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2709", 
                                 "id", 
                                 "progress-animated"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2710", 
                                 "#text", 
                                 "Animated"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2712", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2713", 
                                  "class", 
                                  "bs-component"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "2715", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2716", 
                                   "class", 
                                   "progress"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                                   "2718", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "2719", 
                                    "class", 
                                    "progress-bar progress-bar-striped progress-bar-animated", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "2720", 
                                     "role", 
                                     "progressbar", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "2721", 
                                      "aria_valuenow", 
                                      "75", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "2722", 
                                       "aria_valuemin", 
                                       "0", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "2723", 
                                        "aria_valuemax", 
                                        "100", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "2724", 
                                         "style", 
                                         "width: 75%"
                                        )
                                       )
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    ), 
                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                     "2731", 
                     "#comment", 
                     "Containers      ==================================================", 
                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                      "2733", 
                      "div", 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                       "2734", 
                       "class", 
                       "bs-docs-section"
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                       "2736", 
                       "div", 
                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                        "2737", 
                        "class", 
                        "row"
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                        "2739", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2740", 
                         "class", 
                         "col-lg-12"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "2742", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2743", 
                          "class", 
                          "page-header"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "2745", 
                          "h1", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2746", 
                           "id", 
                           "containers"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2747", 
                           "#text", 
                           "Containers"
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "2750", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2751", 
                           "class", 
                           "bs-component"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "2753", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2754", 
                            "class", 
                            "jumbotron"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2756", 
                            "h1", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2757", 
                             "class", 
                             "display-3"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2758", 
                             "#text", 
                             "Hello, world!"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2760", 
                             "p", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2761", 
                              "class", 
                              "lead"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2762", 
                              "#text", 
                              "This is a simple hero unit, a simple jumbotron-style component for calling extra attention to featured content or information."
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                              "2764", 
                              "hr", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2765", 
                               "class", 
                               "my-4"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                               "2766", 
                               "p", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2767", 
                                "#text", 
                                "It uses utility classes for typography and spacing to space content out within the larger container."
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2769", 
                                "p", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2770", 
                                 "class", 
                                 "lead"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2772", 
                                 "a", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "2773", 
                                  "class", 
                                  "btn btn-primary btn-lg", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "2774", 
                                   "href", 
                                   "#", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2775", 
                                    "role", 
                                    "button"
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2776", 
                                  "#text", 
                                  "Learn more"
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       ), 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "2783", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "2784", 
                         "class", 
                         "row"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "2786", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2787", 
                          "class", 
                          "col-lg-12"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                          "2789", 
                          "h2", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2790", 
                           "#text", 
                           "List groups"
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "2794", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "2795", 
                          "class", 
                          "row"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2797", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2798", 
                           "class", 
                           "col-lg-4"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "2800", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2801", 
                            "class", 
                            "bs-component"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "2803", 
                            "ul", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2804", 
                             "class", 
                             "list-group"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "2805", 
                             "li", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2806", 
                              "class", 
                              "list-group-item d-flex justify-content-between align-items-center"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                              "2807", 
                              "#text", 
                              "Cras justo odio", 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "2808", 
                               "span", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2809", 
                                "class", 
                                "badge badge-primary badge-pill"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2810", 
                                "#text", 
                                "14"
                               )
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2813", 
                              "li", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2814", 
                               "class", 
                               "list-group-item d-flex justify-content-between align-items-center"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2815", 
                               "#text", 
                               "Dapibus ac facilisis in", 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2816", 
                                "span", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2817", 
                                 "class", 
                                 "badge badge-primary badge-pill"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2818", 
                                 "#text", 
                                 "2"
                                )
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "2821", 
                               "li", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2822", 
                                "class", 
                                "list-group-item d-flex justify-content-between align-items-center"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2823", 
                                "#text", 
                                "Morbi leo risus", 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2824", 
                                 "span", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2825", 
                                  "class", 
                                  "badge badge-primary badge-pill"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2826", 
                                  "#text", 
                                  "1"
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "2831", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2832", 
                            "class", 
                            "col-lg-4"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "2834", 
                            "div", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2835", 
                             "class", 
                             "bs-component"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "2837", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2838", 
                              "class", 
                              "list-group"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2840", 
                              "a", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2841", 
                               "href", 
                               "#", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2842", 
                                "class", 
                                "list-group-item list-group-item-action active"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2843", 
                               "#text", 
                               "Cras justo odio"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2845", 
                               "a", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2846", 
                                "href", 
                                "#", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2847", 
                                 "class", 
                                 "list-group-item list-group-item-action"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2848", 
                                "#text", 
                                "Dapibus ac facilisis in"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2850", 
                                "a", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2851", 
                                 "href", 
                                 "#", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2852", 
                                  "class", 
                                  "list-group-item list-group-item-action disabled"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2853", 
                                 "#text", 
                                 "Morbi leo risus"
                                )
                               )
                              )
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "2858", 
                            "div", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2859", 
                             "class", 
                             "col-lg-4"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "2861", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2862", 
                              "class", 
                              "bs-component"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "2864", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "2865", 
                               "class", 
                               "list-group"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2867", 
                               "a", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2868", 
                                "href", 
                                "#", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2869", 
                                 "class", 
                                 "list-group-item list-group-item-action flex-column align-items-start active"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "2871", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2872", 
                                 "class", 
                                 "d-flex w-100 justify-content-between"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "2874", 
                                 "h5", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2875", 
                                  "class", 
                                  "mb-1"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2876", 
                                  "#text", 
                                  "List group item heading"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                                  "2878", 
                                  "small", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2879", 
                                   "#text", 
                                   "3 days ago"
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "2882", 
                                 "p", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2883", 
                                  "class", 
                                  "mb-1"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2884", 
                                  "#text", 
                                  "Donec id elit non mi porta gravida at eget metus. Maecenas sed diam eget risus varius blandit."
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                                  "2886", 
                                  "small", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2887", 
                                   "#text", 
                                   "Donec id elit non mi porta."
                                  )
                                 )
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2890", 
                                "a", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2891", 
                                 "href", 
                                 "#", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2892", 
                                  "class", 
                                  "list-group-item list-group-item-action flex-column align-items-start"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "2894", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2895", 
                                  "class", 
                                  "d-flex w-100 justify-content-between"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "2897", 
                                  "h5", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2898", 
                                   "class", 
                                   "mb-1"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2899", 
                                   "#text", 
                                   "List group item heading"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "2901", 
                                   "small", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2902", 
                                    "class", 
                                    "text-muted"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2903", 
                                    "#text", 
                                    "3 days ago"
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "2906", 
                                  "p", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2907", 
                                   "class", 
                                   "mb-1"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2908", 
                                   "#text", 
                                   "Donec id elit non mi porta gravida at eget metus. Maecenas sed diam eget risus varius blandit."
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "2910", 
                                   "small", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2911", 
                                    "class", 
                                    "text-muted"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2912", 
                                    "#text", 
                                    "Donec id elit non mi porta."
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                          "2919", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "2920", 
                           "class", 
                           "row"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "2922", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2923", 
                            "class", 
                            "col-lg-12"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                            "2925", 
                            "h2", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2926", 
                             "#text", 
                             "Cards"
                            )
                           )
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "2930", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "2931", 
                            "class", 
                            "row"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "2933", 
                            "div", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "2934", 
                             "class", 
                             "col-lg-4"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "2936", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "2937", 
                              "class", 
                              "bs-component"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "2939", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "2940", 
                               "class", 
                               "card text-white bg-primary mb-3", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2941", 
                                "style", 
                                "max-width: 20rem;"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2943", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2944", 
                                "class", 
                                "card-header"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "2945", 
                                "#text", 
                                "Header"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "2947", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2948", 
                                 "class", 
                                 "card-body"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "2950", 
                                 "h4", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2951", 
                                  "class", 
                                  "card-title"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2952", 
                                  "#text", 
                                  "Primary card title"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "2954", 
                                  "p", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2955", 
                                   "class", 
                                   "card-text"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2956", 
                                   "#text", 
                                   "Some quick example text to build on the card title and make up the bulk of the card's content."
                                  )
                                 )
                                )
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "2960", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "2961", 
                                "class", 
                                "card text-white bg-secondary mb-3", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2962", 
                                 "style", 
                                 "max-width: 20rem;"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "2964", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2965", 
                                 "class", 
                                 "card-header"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "2966", 
                                 "#text", 
                                 "Header"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "2968", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2969", 
                                  "class", 
                                  "card-body"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "2971", 
                                  "h4", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2972", 
                                   "class", 
                                   "card-title"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2973", 
                                   "#text", 
                                   "Secondary card title"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "2975", 
                                   "p", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2976", 
                                    "class", 
                                    "card-text"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2977", 
                                    "#text", 
                                    "Some quick example text to build on the card title and make up the bulk of the card's content."
                                   )
                                  )
                                 )
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "2981", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "2982", 
                                 "class", 
                                 "card text-white bg-success mb-3", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2983", 
                                  "style", 
                                  "max-width: 20rem;"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "2985", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2986", 
                                  "class", 
                                  "card-header"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "2987", 
                                  "#text", 
                                  "Header"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "2989", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "2990", 
                                   "class", 
                                   "card-body"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "2992", 
                                   "h4", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2993", 
                                    "class", 
                                    "card-title"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "2994", 
                                    "#text", 
                                    "Success card title"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                    "2996", 
                                    "p", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "2997", 
                                     "class", 
                                     "card-text"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "2998", 
                                     "#text", 
                                     "Some quick example text to build on the card title and make up the bulk of the card's content."
                                    )
                                   )
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "3002", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "3003", 
                                  "class", 
                                  "card text-white bg-danger mb-3", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3004", 
                                   "style", 
                                   "max-width: 20rem;"
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3006", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3007", 
                                   "class", 
                                   "card-header"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3008", 
                                   "#text", 
                                   "Header"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "3010", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3011", 
                                    "class", 
                                    "card-body"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3013", 
                                    "h4", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3014", 
                                     "class", 
                                     "card-title"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3015", 
                                     "#text", 
                                     "Danger card title"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                     "3017", 
                                     "p", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3018", 
                                      "class", 
                                      "card-text"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3019", 
                                      "#text", 
                                      "Some quick example text to build on the card title and make up the bulk of the card's content."
                                     )
                                    )
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3023", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "3024", 
                                   "class", 
                                   "card text-white bg-warning mb-3", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3025", 
                                    "style", 
                                    "max-width: 20rem;"
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "3027", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3028", 
                                    "class", 
                                    "card-header"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3029", 
                                    "#text", 
                                    "Header"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                    "3031", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3032", 
                                     "class", 
                                     "card-body"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                     "3034", 
                                     "h4", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3035", 
                                      "class", 
                                      "card-title"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3036", 
                                      "#text", 
                                      "Warning card title"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                      "3038", 
                                      "p", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3039", 
                                       "class", 
                                       "card-text"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3040", 
                                       "#text", 
                                       "Some quick example text to build on the card title and make up the bulk of the card's content."
                                      )
                                     )
                                    )
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "3044", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3045", 
                                    "class", 
                                    "card text-white bg-info mb-3", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3046", 
                                     "style", 
                                     "max-width: 20rem;"
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3048", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3049", 
                                     "class", 
                                     "card-header"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3050", 
                                     "#text", 
                                     "Header"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                     "3052", 
                                     "div", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3053", 
                                      "class", 
                                      "card-body"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                      "3055", 
                                      "h4", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3056", 
                                       "class", 
                                       "card-title"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3057", 
                                       "#text", 
                                       "Info card title"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                       "3059", 
                                       "p", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3060", 
                                        "class", 
                                        "card-text"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3061", 
                                        "#text", 
                                        "Some quick example text to build on the card title and make up the bulk of the card's content."
                                       )
                                      )
                                     )
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3065", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3066", 
                                     "class", 
                                     "card bg-light mb-3", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3067", 
                                      "style", 
                                      "max-width: 20rem;"
                                     )
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                     "3069", 
                                     "div", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3070", 
                                      "class", 
                                      "card-header"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3071", 
                                      "#text", 
                                      "Header"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                      "3073", 
                                      "div", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3074", 
                                       "class", 
                                       "card-body"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                       "3076", 
                                       "h4", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3077", 
                                        "class", 
                                        "card-title"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3078", 
                                        "#text", 
                                        "Light card title"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                        "3080", 
                                        "p", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3081", 
                                         "class", 
                                         "card-text"
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3082", 
                                         "#text", 
                                         "Some quick example text to build on the card title and make up the bulk of the card's content."
                                        )
                                       )
                                      )
                                     )
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                     "3086", 
                                     "div", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3087", 
                                      "class", 
                                      "card text-white bg-dark mb-3", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3088", 
                                       "style", 
                                       "max-width: 20rem;"
                                      )
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                      "3090", 
                                      "div", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3091", 
                                       "class", 
                                       "card-header"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3092", 
                                       "#text", 
                                       "Header"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                       "3094", 
                                       "div", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3095", 
                                        "class", 
                                        "card-body"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                        "3097", 
                                        "h4", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3098", 
                                         "class", 
                                         "card-title"
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3099", 
                                         "#text", 
                                         "Dark card title"
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                         "3101", 
                                         "p", 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                          "3102", 
                                          "class", 
                                          "card-text"
                                         ), 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                          "3103", 
                                          "#text", 
                                          "Some quick example text to build on the card title and make up the bulk of the card's content."
                                         )
                                        )
                                       )
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "3109", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "3110", 
                              "class", 
                              "col-lg-4"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "3112", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "3113", 
                               "class", 
                               "bs-component"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "3115", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "3116", 
                                "class", 
                                "card border-primary mb-3", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "3117", 
                                 "style", 
                                 "max-width: 20rem;"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "3119", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "3120", 
                                 "class", 
                                 "card-header"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "3121", 
                                 "#text", 
                                 "Header"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "3123", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3124", 
                                  "class", 
                                  "card-body text-primary"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3126", 
                                  "h4", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3127", 
                                   "class", 
                                   "card-title"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3128", 
                                   "#text", 
                                   "Primary card title"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "3130", 
                                   "p", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3131", 
                                    "class", 
                                    "card-text"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3132", 
                                    "#text", 
                                    "Some quick example text to build on the card title and make up the bulk of the card's content."
                                   )
                                  )
                                 )
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "3136", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "3137", 
                                 "class", 
                                 "card border-secondary mb-3", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3138", 
                                  "style", 
                                  "max-width: 20rem;"
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "3140", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3141", 
                                  "class", 
                                  "card-header"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3142", 
                                  "#text", 
                                  "Header"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "3144", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3145", 
                                   "class", 
                                   "card-body text-secondary"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "3147", 
                                   "h4", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3148", 
                                    "class", 
                                    "card-title"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3149", 
                                    "#text", 
                                    "Secondary card title"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                    "3151", 
                                    "p", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3152", 
                                     "class", 
                                     "card-text"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3153", 
                                     "#text", 
                                     "Some quick example text to build on the card title and make up the bulk of the card's content."
                                    )
                                   )
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "3157", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "3158", 
                                  "class", 
                                  "card border-success mb-3", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3159", 
                                   "style", 
                                   "max-width: 20rem;"
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3161", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3162", 
                                   "class", 
                                   "card-header"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3163", 
                                   "#text", 
                                   "Header"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "3165", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3166", 
                                    "class", 
                                    "card-body text-success"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3168", 
                                    "h4", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3169", 
                                     "class", 
                                     "card-title"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3170", 
                                     "#text", 
                                     "Success card title"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                     "3172", 
                                     "p", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3173", 
                                      "class", 
                                      "card-text"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3174", 
                                      "#text", 
                                      "Some quick example text to build on the card title and make up the bulk of the card's content."
                                     )
                                    )
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3178", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "3179", 
                                   "class", 
                                   "card border-danger mb-3", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3180", 
                                    "style", 
                                    "max-width: 20rem;"
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "3182", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3183", 
                                    "class", 
                                    "card-header"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3184", 
                                    "#text", 
                                    "Header"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                    "3186", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3187", 
                                     "class", 
                                     "card-body text-danger"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                     "3189", 
                                     "h4", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3190", 
                                      "class", 
                                      "card-title"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3191", 
                                      "#text", 
                                      "Danger card title"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                      "3193", 
                                      "p", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3194", 
                                       "class", 
                                       "card-text"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3195", 
                                       "#text", 
                                       "Some quick example text to build on the card title and make up the bulk of the card's content."
                                      )
                                     )
                                    )
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "3199", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3200", 
                                    "class", 
                                    "card border-warning mb-3", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3201", 
                                     "style", 
                                     "max-width: 20rem;"
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3203", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3204", 
                                     "class", 
                                     "card-header"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3205", 
                                     "#text", 
                                     "Header"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                     "3207", 
                                     "div", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3208", 
                                      "class", 
                                      "card-body text-warning"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                      "3210", 
                                      "h4", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3211", 
                                       "class", 
                                       "card-title"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3212", 
                                       "#text", 
                                       "Warning card title"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                       "3214", 
                                       "p", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3215", 
                                        "class", 
                                        "card-text"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3216", 
                                        "#text", 
                                        "Some quick example text to build on the card title and make up the bulk of the card's content."
                                       )
                                      )
                                     )
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3220", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3221", 
                                     "class", 
                                     "card border-info mb-3", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3222", 
                                      "style", 
                                      "max-width: 20rem;"
                                     )
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                     "3224", 
                                     "div", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3225", 
                                      "class", 
                                      "card-header"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3226", 
                                      "#text", 
                                      "Header"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                      "3228", 
                                      "div", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3229", 
                                       "class", 
                                       "card-body text-info"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                       "3231", 
                                       "h4", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3232", 
                                        "class", 
                                        "card-title"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3233", 
                                        "#text", 
                                        "Info card title"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                        "3235", 
                                        "p", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3236", 
                                         "class", 
                                         "card-text"
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3237", 
                                         "#text", 
                                         "Some quick example text to build on the card title and make up the bulk of the card's content."
                                        )
                                       )
                                      )
                                     )
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                     "3241", 
                                     "div", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3242", 
                                      "class", 
                                      "card border-light mb-3", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3243", 
                                       "style", 
                                       "max-width: 20rem;"
                                      )
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                      "3245", 
                                      "div", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3246", 
                                       "class", 
                                       "card-header"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3247", 
                                       "#text", 
                                       "Header"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                       "3249", 
                                       "div", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3250", 
                                        "class", 
                                        "card-body"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                        "3252", 
                                        "h4", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3253", 
                                         "class", 
                                         "card-title"
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3254", 
                                         "#text", 
                                         "Light card title"
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                         "3256", 
                                         "p", 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                          "3257", 
                                          "class", 
                                          "card-text"
                                         ), 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                          "3258", 
                                          "#text", 
                                          "Some quick example text to build on the card title and make up the bulk of the card's content."
                                         )
                                        )
                                       )
                                      )
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                      "3262", 
                                      "div", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "3263", 
                                       "class", 
                                       "card border-dark mb-3", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3264", 
                                        "style", 
                                        "max-width: 20rem;"
                                       )
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                       "3266", 
                                       "div", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3267", 
                                        "class", 
                                        "card-header"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3268", 
                                        "#text", 
                                        "Header"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                        "3270", 
                                        "div", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3271", 
                                         "class", 
                                         "card-body text-dark"
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                         "3273", 
                                         "h4", 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                          "3274", 
                                          "class", 
                                          "card-title"
                                         ), 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                          "3275", 
                                          "#text", 
                                          "Dark card title"
                                         ), 
                                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                          "3277", 
                                          "p", 
                                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                           "3278", 
                                           "class", 
                                           "card-text"
                                          ), 
                                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                           "3279", 
                                           "#text", 
                                           "Some quick example text to build on the card title and make up the bulk of the card's content."
                                          )
                                         )
                                        )
                                       )
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "3285", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "3286", 
                               "class", 
                               "col-lg-4"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "3288", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "3289", 
                                "class", 
                                "bs-component"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "3291", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "3292", 
                                 "class", 
                                 "card mb-3"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "3294", 
                                 "h3", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3295", 
                                  "class", 
                                  "card-header"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3296", 
                                  "#text", 
                                  "Card header"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3298", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3299", 
                                   "class", 
                                   "card-body"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "3301", 
                                   "h5", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3302", 
                                    "class", 
                                    "card-title"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3303", 
                                    "#text", 
                                    "Special title treatment"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                    "3305", 
                                    "h6", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3306", 
                                     "class", 
                                     "card-subtitle text-muted"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3307", 
                                     "#text", 
                                     "Support card subtitle"
                                    )
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, СоседнийУзел",
                                   "3310", 
                                   "img", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3311", 
                                    "style", 
                                    "height: 200px; width: 100%; display: block;", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3312", 
                                     "src", 
                                     "data:image/svg+xml;charset=UTF-8,%3Csvg%20width%3D%22318%22%20height%3D%22180%22%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20viewBox%3D%220%200%20318%20180%22%20preserveAspectRatio%3D%22none%22%3E%3Cdefs%3E%3Cstyle%20type%3D%22text%2Fcss%22%3E%23holder_158bd1d28ef%20text%20%7B%20fill%3Argba(255%2C255%2C255%2C.75)%3Bfont-weight%3Anormal%3Bfont-family%3AHelvetica%2C%20monospace%3Bfont-size%3A16pt%20%7D%20%3C%2Fstyle%3E%3C%2Fdefs%3E%3Cg%20id%3D%22holder_158bd1d28ef%22%3E%3Crect%20width%3D%22318%22%20height%3D%22180%22%20fill%3D%22%23777%22%3E%3C%2Frect%3E%3Cg%3E%3Ctext%20x%3D%22129.359375%22%20y%3D%2297.35%22%3EImage%3C%2Ftext%3E%3C%2Fg%3E%3C%2Fg%3E%3C%2Fsvg%3E", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3313", 
                                      "alt", 
                                      "Card image"
                                     )
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3314", 
                                    "div", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3315", 
                                     "class", 
                                     "card-body"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                     "3317", 
                                     "p", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3318", 
                                      "class", 
                                      "card-text"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3319", 
                                      "#text", 
                                      "Some quick example text to build on the card title and make up the bulk of the card's content."
                                     )
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                     "3322", 
                                     "ul", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3323", 
                                      "class", 
                                      "list-group list-group-flush"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                      "3324", 
                                      "li", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3325", 
                                       "class", 
                                       "list-group-item"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3326", 
                                       "#text", 
                                       "Cras justo odio"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                       "3328", 
                                       "li", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3329", 
                                        "class", 
                                        "list-group-item"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3330", 
                                        "#text", 
                                        "Dapibus ac facilisis in"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                        "3332", 
                                        "li", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3333", 
                                         "class", 
                                         "list-group-item"
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3334", 
                                         "#text", 
                                         "Vestibulum at eros"
                                        )
                                       )
                                      )
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                      "3336", 
                                      "div", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3337", 
                                       "class", 
                                       "card-body"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                       "3339", 
                                       "a", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "3340", 
                                        "href", 
                                        "#", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3341", 
                                         "class", 
                                         "card-link"
                                        )
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3342", 
                                        "#text", 
                                        "Card link"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                        "3344", 
                                        "a", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                         "3345", 
                                         "href", 
                                         "#", 
                                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                          "3346", 
                                          "class", 
                                          "card-link"
                                         )
                                        ), 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3347", 
                                         "#text", 
                                         "Another link"
                                        )
                                       )
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                       "3350", 
                                       "div", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3351", 
                                        "class", 
                                        "card-footer text-muted"
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3352", 
                                        "#text", 
                                        "2 days ago"
                                       )
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                 "3355", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3356", 
                                  "class", 
                                  "card"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "3358", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3359", 
                                   "class", 
                                   "card-body"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "3361", 
                                   "h4", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3362", 
                                    "class", 
                                    "card-title"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3363", 
                                    "#text", 
                                    "Card title"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3365", 
                                    "h6", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3366", 
                                     "class", 
                                     "card-subtitle mb-2 text-muted"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3367", 
                                     "#text", 
                                     "Card subtitle"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                     "3369", 
                                     "p", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3370", 
                                      "class", 
                                      "card-text"
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3371", 
                                      "#text", 
                                      "Some quick example text to build on the card title and make up the bulk of the card's content."
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                      "3373", 
                                      "a", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "3374", 
                                       "href", 
                                       "#", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3375", 
                                        "class", 
                                        "card-link"
                                       )
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3376", 
                                       "#text", 
                                       "Card link"
                                      ), 
                                      Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                       "3378", 
                                       "a", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "3379", 
                                        "href", 
                                        "#", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3380", 
                                         "class", 
                                         "card-link"
                                        )
                                       ), 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3381", 
                                        "#text", 
                                        "Another link"
                                       )
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      ), 
                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                       "3389", 
                       "#comment", 
                       "Dialogs      ==================================================", 
                       Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                        "3391", 
                        "div", 
                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                         "3392", 
                         "class", 
                         "bs-docs-section"
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                         "3394", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое",
                          "3395", 
                          "class", 
                          "row"
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "3397", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "3398", 
                           "class", 
                           "col-lg-12"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "3400", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "3401", 
                            "class", 
                            "page-header"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "3403", 
                            "h1", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "3404", 
                             "id", 
                             "dialogs"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "3405", 
                             "#text", 
                             "Dialogs"
                            )
                           )
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "3410", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "3411", 
                           "class", 
                           "row"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                           "3413", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "3414", 
                            "class", 
                            "col-lg-6"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                            "3416", 
                            "h2", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "3417", 
                             "#text", 
                             "Modals"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "3419", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "3420", 
                              "class", 
                              "bs-component"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "3422", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "3423", 
                               "class", 
                               "modal"
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                               "3425", 
                               "div", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "3426", 
                                "class", 
                                "modal-dialog", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "3427", 
                                 "role", 
                                 "document"
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "3429", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "3430", 
                                 "class", 
                                 "modal-content"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "3432", 
                                 "div", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3433", 
                                  "class", 
                                  "modal-header"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3435", 
                                  "h5", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3436", 
                                   "class", 
                                   "modal-title"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3437", 
                                   "#text", 
                                   "Modal title"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "3439", 
                                   "button", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3440", 
                                    "type", 
                                    "button", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3441", 
                                     "class", 
                                     "close", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3442", 
                                      "data_dismiss", 
                                      "modal", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3443", 
                                       "aria_label", 
                                       "Close"
                                      )
                                     )
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                    "3445", 
                                    "span", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3446", 
                                     "aria_hidden", 
                                     "true"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3447", 
                                     "#text", 
                                     "×"
                                    )
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3451", 
                                  "div", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3452", 
                                   "class", 
                                   "modal-body"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, ДочернийУзел",
                                   "3454", 
                                   "p", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3455", 
                                    "#text", 
                                    "Modal body text goes here."
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                   "3458", 
                                   "div", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3459", 
                                    "class", 
                                    "modal-footer"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                    "3461", 
                                    "button", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3462", 
                                     "type", 
                                     "button", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3463", 
                                      "class", 
                                      "btn btn-primary"
                                     )
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3464", 
                                     "#text", 
                                     "Save changes"
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                     "3466", 
                                     "button", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3467", 
                                      "type", 
                                      "button", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "3468", 
                                       "class", 
                                       "btn btn-secondary", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3469", 
                                        "data_dismiss", 
                                        "modal"
                                       )
                                      )
                                     ), 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3470", 
                                      "#text", 
                                      "Close"
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                            "3478", 
                            "div", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "3479", 
                             "class", 
                             "col-lg-6"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                             "3481", 
                             "h2", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "3482", 
                              "#text", 
                              "Popovers"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                              "3484", 
                              "div", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "3485", 
                               "class", 
                               "bs-component", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "3486", 
                                "style", 
                                "margin-bottom: 3em;"
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                               "3488", 
                               "button", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "3489", 
                                "type", 
                                "button", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "3490", 
                                 "class", 
                                 "btn btn-secondary", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "3491", 
                                  "title", 
                                  "Popover Title", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "3492", 
                                   "data_container", 
                                   "body", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3493", 
                                    "data_toggle", 
                                    "popover", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3494", 
                                     "data_placement", 
                                     "left", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3495", 
                                      "data_content", 
                                      "Vivamus sagittis lacus vel augue laoreet rutrum faucibus."
                                     )
                                    )
                                   )
                                  )
                                 )
                                )
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "3496", 
                                "#text", 
                                "Left"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                "3498", 
                                "button", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "3499", 
                                 "type", 
                                 "button", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "3500", 
                                  "class", 
                                  "btn btn-secondary", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "3501", 
                                   "title", 
                                   "Popover Title", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3502", 
                                    "data_container", 
                                    "body", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3503", 
                                     "data_toggle", 
                                     "popover", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3504", 
                                      "data_placement", 
                                      "top", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3505", 
                                       "data_content", 
                                       "Vivamus sagittis lacus vel augue laoreet rutrum faucibus."
                                      )
                                     )
                                    )
                                   )
                                  )
                                 )
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "3506", 
                                 "#text", 
                                 "Top"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "3508", 
                                 "button", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "3509", 
                                  "type", 
                                  "button", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "3510", 
                                   "class", 
                                   "btn btn-secondary", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3511", 
                                    "title", 
                                    "Popover Title", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3512", 
                                     "data_container", 
                                     "body", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3513", 
                                      "data_toggle", 
                                      "popover", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "3514", 
                                       "data_placement", 
                                       "bottom", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3515", 
                                        "data_content", 
                                        "Vivamus              sagittis lacus vel augue laoreet rutrum faucibus."
                                       )
                                      )
                                     )
                                    )
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3516", 
                                  "#text", 
                                  "Bottom"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                  "3518", 
                                  "button", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "3519", 
                                   "type", 
                                   "button", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3520", 
                                    "class", 
                                    "btn btn-secondary", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3521", 
                                     "title", 
                                     "Popover Title", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3522", 
                                      "data_container", 
                                      "body", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "3523", 
                                       "data_toggle", 
                                       "popover", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "3524", 
                                        "data_placement", 
                                        "right", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3525", 
                                         "data_content", 
                                         "Vivamus sagittis lacus vel augue laoreet rutrum faucibus."
                                        )
                                       )
                                      )
                                     )
                                    )
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3526", 
                                   "#text", 
                                   "Right"
                                  )
                                 )
                                )
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, ДочернийУзел, СоседнийУзел",
                               "3529", 
                               "h2", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                "3530", 
                                "#text", 
                                "Tooltips"
                               ), 
                               Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                "3532", 
                                "div", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                 "3533", 
                                 "class", 
                                 "bs-component"
                                ), 
                                Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                 "3535", 
                                 "button", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                  "3536", 
                                  "type", 
                                  "button", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "3537", 
                                   "class", 
                                   "btn btn-secondary", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3538", 
                                    "data_toggle", 
                                    "tooltip", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3539", 
                                     "data_placement", 
                                     "left", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                      "3540", 
                                      "title", 
                                      "Tooltip on left"
                                     )
                                    )
                                   )
                                  )
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3541", 
                                  "#text", 
                                  "Left"
                                 ), 
                                 Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                  "3543", 
                                  "button", 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                   "3544", 
                                   "type", 
                                   "button", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3545", 
                                    "class", 
                                    "btn btn-secondary", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3546", 
                                     "data_toggle", 
                                     "tooltip", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3547", 
                                      "data_placement", 
                                      "top", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                       "3548", 
                                       "title", 
                                       "Tooltip on top"
                                      )
                                     )
                                    )
                                   )
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                   "3549", 
                                   "#text", 
                                   "Top"
                                  ), 
                                  Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                                   "3551", 
                                   "button", 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                    "3552", 
                                    "type", 
                                    "button", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3553", 
                                     "class", 
                                     "btn btn-secondary", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3554", 
                                      "data_toggle", 
                                      "tooltip", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "3555", 
                                       "data_placement", 
                                       "bottom", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                        "3556", 
                                        "title", 
                                        "Tooltip on bottom"
                                       )
                                      )
                                     )
                                    )
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                    "3557", 
                                    "#text", 
                                    "Bottom"
                                   ), 
                                   Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                                    "3559", 
                                    "button", 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                     "3560", 
                                     "type", 
                                     "button", 
                                     Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                      "3561", 
                                      "class", 
                                      "btn btn-secondary", 
                                      Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                       "3562", 
                                       "data_toggle", 
                                       "tooltip", 
                                       Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                        "3563", 
                                        "data_placement", 
                                        "right", 
                                        Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                         "3564", 
                                         "title", 
                                         "Tooltip on right"
                                        )
                                       )
                                      )
                                     )
                                    ), 
                                    Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                     "3565", 
                                     "#text", 
                                     "Right"
                                    )
                                   )
                                  )
                                 )
                                )
                               )
                              )
                             )
                            )
                           )
                          )
                         )
                        ), 
                        Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                         "3571", 
                         "div", 
                         Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                          "3572", 
                          "id", 
                          "source-modal", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "3573", 
                           "class", 
                           "modal fade"
                          )
                         ), 
                         Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                          "3575", 
                          "div", 
                          Новый Структура("КодУзла, ИмяУзла, Содержимое",
                           "3576", 
                           "class", 
                           "modal-dialog modal-lg"
                          ), 
                          Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                           "3578", 
                           "div", 
                           Новый Структура("КодУзла, ИмяУзла, Содержимое",
                            "3579", 
                            "class", 
                            "modal-content"
                           ), 
                           Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                            "3581", 
                            "div", 
                            Новый Структура("КодУзла, ИмяУзла, Содержимое",
                             "3582", 
                             "class", 
                             "modal-header"
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел, СоседнийУзел",
                             "3584", 
                             "h4", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "3585", 
                              "class", 
                              "modal-title"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "3586", 
                              "#text", 
                              "Source Code"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                              "3588", 
                              "button", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                               "3589", 
                               "type", 
                               "button", 
                               Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                "3590", 
                                "class", 
                                "close", 
                                Новый Структура("КодУзла, ИмяУзла, Содержимое, СоседнийУзел",
                                 "3591", 
                                 "data_dismiss", 
                                 "modal", 
                                 Новый Структура("КодУзла, ИмяУзла, Содержимое",
                                  "3592", 
                                  "aria_hidden", 
                                  "true"
                                 )
                                )
                               )
                              ), 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "3593", 
                               "#text", 
                               "×"
                              )
                             )
                            ), 
                            Новый Структура("КодУзла, ИмяУзла, Атрибуты, ДочернийУзел",
                             "3596", 
                             "div", 
                             Новый Структура("КодУзла, ИмяУзла, Содержимое",
                              "3597", 
                              "class", 
                              "modal-body"
                             ), 
                             Новый Структура("КодУзла, ИмяУзла, Атрибуты",
                              "3599", 
                              "p", 
                              Новый Структура("КодУзла, ИмяУзла, Содержимое",
                               "3600", 
                               "id", 
                               "sourcecode"
                              )
                             )
                            )
                           )
                          )
                         )
                        )
                       )
                      )
                     )
                    )
                   )
                  )
                 )
                )
               )
              )
             )
            )
           )
          )
         )
        )
       )
      )
     )
    ), 
    Новый Структура("КодУзла, ИмяУзла, Содержимое",
     "3607", 
     "#comment", 
     "script src=""/resource/custom.js""></script"
    )
   )
  )
 )
);
КодУзла = "3608";