Имя	div	Дочерний	183	Соседний	4


Имя	Список	Дочерний	5	Старший	1
Имя	Объект	Значение	Функция	Соседний	6	Старший	4
Имя	Объект	Значение	Максимум	Соседний	7	Старший	5
Имя	Список	Дочерний	8	Соседний	10	Старший	6
Имя	Объект	Значение	А	Соседний	9	Старший	7
Имя	Объект	Значение	Б	Старший	8
Имя	Список	Дочерний	11	Старший	7
Имя	Объект	Значение	Если	Соседний	12	Старший	10
Имя	Список	Дочерний	13	Соседний	16	Старший	11
Имя	Объект	Значение	>	Соседний	14	Старший	12
Имя	Объект	Значение	А	Соседний	15	Старший	13
Имя	Объект	Значение	Б	Старший	14
Имя	Список	Дочерний	17	Соседний	18	Старший	12
Имя	Объект	Значение	А	Старший	16
Имя	Список	Дочерний	19	Старший	16
Имя	Объект	Значение	Б	Старший	18

Имя	Объект	Значение	Функция	Соседний	45	Старший	20	Дочерний	55	Родитель	20
Имя	Объект	Значение	Максимум	Соседний	23	Старший	21	Родитель	20
Имя	Список	Дочерний	24	Соседний	45	Старший	21	Родитель	20
Имя	Объект	Значение	А	Соседний	25	Старший	23
Имя	Объект	Значение	Б	Старший	24











Имя	Объект	Значение	Максимум	Старший	36	Дочерний	64	Родитель	36
Имя	Число	Значение	3	Соседний	39	Старший	37	Родитель	36
Имя	Число	Значение	12	Старший	37	Родитель	36





Имя	Узел	Значение		Старший	20	Дочерний	46	Родитель	20
Имя	p	Значение		Старший	45	Дочерний	53	Родитель	45
Имя	a	Значение		Старший	53	Атрибут	49	Дочерний	54

Имя	href	Значение		Старший	47



Имя	Объект	Значение	А	Соседний	47	Старший	46
Имя	Объект	Значение	Б	Старший	47
Имя	Объект	Значение	Максимум	Старший	21	Родитель	20	Дочерний	56
Имя	Список	Дочерний	57	Старший	55	Родитель	20
Имя	Объект	Значение	А	Соседний	58	Старший	56
Имя	Объект	Значение	Б	Старший	57
Имя	Объект	Значение	Функция	Соседний	72	Старший	20	Дочерний	60	Родитель	20
Имя	Объект	Значение	Максимум	Старший	59	Родитель	20	Дочерний	61	Соседний	66
Имя	Список	Дочерний	62	Старший	60	Родитель	20
Имя	Объект	Значение	А	Соседний	63	Старший	61
Имя	Объект	Значение	Б	Старший	62
Имя	Число	Значение	3	Соседний	65	Старший	37	Родитель	36
Имя	Число	Значение	12	Старший	64	Родитель	36
Имя	Узел	Значение		Старший	60	Дочерний	67	Родитель	20
Имя	p	Значение		Старший	66	Дочерний	68	Родитель	45
Имя	Объект	Значение	А	Соседний	69	Старший	67
Имя	a	Значение		Старший	68	Атрибут	70	Дочерний	71
Имя	href	Значение		Старший	69
Имя	Объект	Значение	Б	Старший	69




Имя	Функция	Значение	Максимум	Старший	75	Родитель	20	Дочерний	77
Имя	Список	Дочерний	78	Старший	76	Родитель	20	Соседний	100
Имя	Объект	Значение	А	Соседний	79	Старший	77
Имя	Объект	Значение	Б	Старший	78
Имя	Узел	Значение		Старший	76	Дочерний	81	Родитель	20
Имя	p	Значение		Старший	80	Дочерний	82	Родитель	45
Имя	Объект	Значение	А	Соседний	83	Старший	81
Имя	a	Значение		Старший	82	Атрибут	84	Дочерний	85
Имя	href	Значение		Старший	83
Имя	Объект	Значение	Б	Старший	83



Имя	a	Значение		Старший	88	Атрибут	90	Дочерний	91	Родитель	87
Имя	href	Значение		Старший	89
Имя	Объект	Значение	Б	Старший	89
Имя	a	Значение		Старший	88	Атрибут	93	Дочерний	94	Родитель	87
Имя	href	Значение		Старший	92
Имя	Объект	Значение	Б	Старший	92



Имя	Объект	Значение	А	Старший	100	Родитель	76

Имя	Узел	Значение		Старший	77	Родитель	76	Дочерний	101
Имя	h3	Значение		Старший	100	Дочерний	103

Имя	Объект	Значение	А	Старший	101	Родитель	76
Имя	Функция	Значение	Кнопка	Старший	183	Родитель	20	Дочерний	105	Соседний	136
Имя	Список	Дочерний	106	Старший	104	Родитель	20	Соседний	159
Имя	Объект	Значение	Надпись	Соседний	107	Старший	105
Имя	Объект	Значение	Команда	Старший	106
Имя	Узел	Значение		Старший	159	Родитель	76	Дочерний	131






















Имя	button	Атрибут	132	Дочерний	135	Старший	108	Родитель	108
Имя	type	Значение	button	Соседний	133	Старший	131
Имя	class	Значение	btn btn-primary	Старший	132	Соседний	153

Имя	Объект	Значение	Надпись	Старший	131	Родитель	131
Имя	Объект	Значение	Кнопка	Старший	104	Родитель	1	Дочерний	137	Соседний	187
Имя	Строка	Значение	Нажми на кнопку	Старший	136	Соседний	179
Имя	Строка	Значение	ага!	Старший	174	Родитель	136
Имя	Пусть	Значение	onclick	Старший	159	Соседний	108	Родитель	104	Дочерний	154
Имя	Объект	Значение	+	Старший	139	Родитель	139












Имя	Объект	Значение	onclick	Старший	133	Родитель	108
Имя	Объект	Значение	+	Старший	139	Родитель	139	Дочерний	155
Имя	Строка	Значение	sendcmd('nodeid=	Старший	154	Соседний	156
Имя	Свойство	Значение	Код	Старший	155	Родитель	145	Соседний	158	Дочерний	157
Имя	Объект	Старший	156	Родитель	147	Значение	Команда
Имя	Строка	Значение	&cmd=exec'); return false;	Старший	156	Родитель	145
Имя	Список	Значение		Старший	105	Родитель	104	Дочерний	160
Имя	Пусть	Значение	onclick	Старший	159	Соседний	166	Родитель	159	Дочерний	161
Имя	Объект	Значение	+	Старший	160	Родитель	139	Дочерний	162
Имя	Строка	Значение	onclick="sendcmd('nodeid=	Старший	161	Соседний	177
Имя	Свойство	Значение	Код	Старший	162	Родитель	161	Соседний	165	Дочерний	176
Имя	Объект	Старший	172	Родитель	163	Значение	Команда
Имя	Строка	Значение	&cmd=exec');"	Старший	177	Родитель	145
Имя	Узел	Значение		Старший	160	Родитель	159	Дочерний	167
Имя	button	Атрибут	168	Дочерний	171	Старший	166	Родитель	108
Имя	type	Значение	button	Соседний	169	Старший	167
Имя	class	Значение	btn btn-primary	Старший	168	Соседний	170
Имя	Объект	Значение	onclick	Старший	169	Родитель	108
Имя	Объект	Значение	Надпись	Старший	167	Родитель	131

Имя	Объект	Старший	172	Родитель	172	Значение	Команда
Имя	Объект	Значение	Сообщить	Старший	179	Родитель	136	Дочерний	175
Имя	Строка	Значение	ага!	Старший	174	Родитель	174
Имя	Объект	Старший	163	Родитель	163	Значение	Команда
Имя	Свойство	Значение	Код	Старший	162	Родитель	161	Соседний	165	Дочерний	178
Имя	Объект	Старший	177	Родитель	163	Значение	Команда
Имя	Ссылка	Значение		Старший	137	Родитель	136	Дочерний	185



Имя	Пусть	Значение	Результат	Старший	1	Соседний	104	Дочерний	184
Имя	Строка	Значение		Старший	183
Имя	Пусть	Значение	Результат	Старший	179	Дочерний	186	Родитель	179
Имя	Строка	Значение	Результат	Старший	185
Имя	H1	Значение		Старший	136	Родитель	1	Дочерний	188
Имя	Объект	Значение	Результат	Старший	187
